{
  "offset": 0,
  "number": 100,
  "available": 62,
  "news": [
    {
      "id": 137413293,
      "title": "Superstar Rajinikanth Meets UP CM Yogi Adityanath, Touches His Feet as a Gesture of Respect | WATCH VIDEO",
      "text": "South Indian superstar, Rajinikanth, along with his wife, Latha Rajinikanth, made a visit to the city of Lucknow on Friday (August 19). This visit comes on the heels of the massive success of his film 'Jailer' at the box office, which has been creating waves since its release.Rajinikanth, who returned to the big screen after a two-year hiatus, has witnessed tremendous success with 'Jailer.' .Meeting with CM Yogi Adityanath Following a visit to the Badrinath shrine in Uttarakhand, Rajinikanth made his way directly to Lucknow. He began his visit by meeting Deputy CM Keshav Prasad Maurya. During this time, a special screening of Rajinikanth's film 'Jailor' was organized. Both dignitaries sat down together at 1:30 PM to watch the film at Lucknow's INOX Megaplex within the Phoenix Pallasio. Following the screening, Rajinikanth proceeded to the residence of Chief Minister Yogi Adityanath.A video making rounds on social media captured the moment when Rajinikanth stepped out of his car and touched the feet of Chief Minister Yogi Adityanath as a mark of respect. .CM Yogi Adityanath warmly welcomed Rajinikanth with a bouquet of flowers and led him inside with utmost reverence.The two engaged in conversation, during which CM Yogi Adityanath presented Rajinikanth with a book and a shawl as tokens of appreciation..UP: Tuition Teacher Mohammad Aamir Held for Showing Inappropriate Videos to Minors | WATCH VIDEO",
      "url": "https://www.sinceindependence.com/states/uttar-pradesh/superstar-rajinikanth-meets-up-cm-yogi-adityanath-touches-his-feet-as-a-gesture-of-respect-video",
      "image": "https://gumlet.assettype.com/sinceindependence/2023-08/d7eb4ae3-2207-4775-ae0e-c7cf596752ee/entertainment_news.jpg?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true",
      "publish_date": "2023-08-20 11:08:13",
      "author": "Since Independenc",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.458
    },
    {
      "id": 136590771,
      "title": "Rajinikanth meets Jharkhand governor CP Radhakrishnan after trip to Himalayas",
      "text": "Superstar Rajinikanth is back from his Himalayas tour, and he has straightaway headed to meet Jharkhand governor CP Radhakrishnan in Ranchi. Radhakrishnan, hailing from Tamil Nadu, was the former state president of the Bharatiya Janata Party in the state. Pictures from the meeting of the two have been widely shared on social media. The governor also took to Twitter to share details about his meeting with Rajinikanth. He wrote, \"On his arrival in Ranchi, delighted and very happy to meet my dear friend, one of India's greatest Actors and great Human Being Superstar Shri. @rajinikanth Ji at Raj Bhavan yesterday on a courtesy meet. I heartily welcome him to the great land of Jharkhand.\" On his arrival in Ranchi , delighted and very happy to meet my dear friend , one of India's greatest Actors and great Human Being Superstar Shri. @rajinikanth Ji at Raj Bhavan yesterday on a courtesy meet. I heartily welcome him to the great land of Jharkhand. pic.twitter.com/oyM049CWMv — CP Radhakrishnan (@CPRGuv) August 17, 2023 Rajinikanth gifted a spiritual book to the governor during the meeting. Back home, Rajinikanth's Jailer is breaking box office records one after the other. It has become the fastest Tamil film in history to cross Rs 150 crore at the box office. The movie has so far earned about Rs 450 crore worldwide. Rajinikanth left for his trip even before the release of the film. He will have a grand welcome once he is back in Chennai. Directed by Nelson Dilipkumar, Jailer is a masala film with cameos from Mohanlal, Shivarajkumar, and Jackie Shroff. With music by Anirudh Ravichander, the movie has become a hit in Telugu, Kannada, and Malayalam as well. Rajinikanth will next team up with TJ Gnanavel of Jai Bhim fame.",
      "url": "https://indianexpress.com/article/entertainment/tamil/rajinikanth-meets-jharkhand-governor-cp-radhakrishnan-8896507/",
      "image": "https://images.indianexpress.com/2023/08/Rajinikanth-CP-Radhakrishnan-1200.jpg",
      "publish_date": "2023-08-17 10:44:44",
      "author": "Nelson Dilipkumar",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.748
    },
    {
      "id": 136950789,
      "title": "Rajinikanth Arrives In Lucknow To Meet UP CM Yogi Adityanath, Says I Will Watch Jailer With Him",
      "text": "Superstar Rajinikanth is all set to share the big screen experience of his latest blockbuster 'Jailer' with none other than Uttar Pradesh Chief Minister Yogi Adityanath. The Tamil icon, who has been ruling hearts for decades, touched down in Lucknow earlier today, heralding excitement among the city's cinephiles. With 'Jailer' already minting success at the box office, Rajinikanth's decision to personally view the movie alongside Yogi Adityanath comes as a pleasant surprise. As he disembarked from his plane, Rajinikanth shared, \"I will watch the film with him,\" responding to queries about the eagerly anticipated movie screening. Gracing the film's triumph, Rajinikanth humbly attributed its success to divine blessings. \"Sab Bhagwan ka dua hai,\" he expressed, his gratitude evident as he waved to the throng of fans eagerly awaiting his presence. RAJINIKANTH MET HER 'GURU' IN JHANRKHAND BEFORE ARRIVING IN LUCKNOW The superstar's recent journey to Ranchi, Jharkhand, where he paid homage to his 'guru' Yogananda, remains fresh in memory. Following 'Jailer's' triumphant release, Rajinikanth journeyed to the heartland to honor the teachings of his guru. During his solo journey, he shared moments with Jharkhand's governor CP Radhakrishnan, capturing the camaraderie through pictures shared on social media. ABOUT JAILER 'Jailer', an engaging Tamil film, marks Rajinikanth's return to the silver screen after a hiatus of two years. Released merely a week ago, the movie is a gripping tale of a jailer's valiant stand against a gang's audacious bid to liberate their incarcerated leader. With a global box office tally of approximately ₹375 crore in its maiden week, the film, featuring stalwarts like Tamannaah and Jackie Shroff, continues to enthrall audiences far and wide. (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.)",
      "url": "https://www.freepressjournal.in/entertainment/watch-rajinikanth-arrives-in-lucknow-to-meet-up-cm-yogi-adityanath-says-i-will-watch-jailer-with-him",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/90b1aa28-9ef8-4163-9469-841fdb6efed4/Rajinikanth.JPG",
      "publish_date": "2023-08-18 17:43:00",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.649
    },
    {
      "id": 135945303,
      "title": "Jailer box office collection Day 5: Rajinikanth film set to cross Rs 350-crore mark worldwide on Independence Day",
      "text": "Even in the midst of fierce competition from various quarters, Nelson Dilipkumar's Jailer, starring Superstar Rajinikanth in the lead role, is confidently pushing forward, firmly declaring its determination to maintain its impressive performance at the box office. Following its remarkable achievement of earning Rs 150 crore in the domestic market over its debut weekend, Jailer managed to generate an estimated Rs 28 crore on the fifth day of its release, which was Monday, according to early estimates shared by industry tracker Sacnilk. Thus, the global box office revenue of Jailer will cross the Rs 350-crore mark on Independence Day. The movie's net earnings in India on Monday surpass those from Friday (Rs 25.75 crore), indicating a stable advancement in the trajectory of Jailer. According to Sacnilk's forecast, the Rajinikanth movie is expected to achieve domestic earnings of around Rs 38 crore on Tuesday, benefiting from the Independence Day holiday, which will contribute to its ongoing impressive performance. The actioner also recorded an overall 63 per cent Tamil occupancy on Friday. While the film witnessed a 37.06 per cent occupancy in the Tamil market for morning shows, as the day progressed, the percentages steadily surged, reaching 59.03 per cent for afternoon shows, 72.84 per cent for evening shows, and an impressive 83.07 per cent for night shows. Meanwhile, industry tracker Ramesh Bala tweeted that Rajinikanth's Jailer made $180K in the US on August 14. As per analyst group Aakashavaani, the film garnered an estimated sum of Rs 33.45 crore from the US in its opening weekend. Concurrently, it accumulated around Rs 23.4 crore from the UAE region. Jailer also registered earnings of Rs 9.15 crore from the remaining Gulf Cooperation Council nations, Rs 3 crore from the Kingdom of Saudi Arabia, Rs 5.55 crore from Australia, and Rs 68.2 lakh from New Zealand. The United Kingdom and Ireland together contributed Rs 7.68 crore, while Singapore provided Rs 6.78 crore. Furthermore, the film achieved Rs 17.01 crore from Malaysia, Rs 6.24 crore from Canada, and Rs 13 crore from Europe, Sri Lanka, and other territories. Currently, the only significant contender that matches Jailer's impressive box office success is Sunny Deol's Gadar 2, which has already secured Rs 173.88 crore at the domestic box office and is poised to achieve a Rs 55-crore turnover on Independence Day, contributing to its cumulative India nett earnings of Rs 228.88 crore. On Monday, Kamal Haasan also congratulated Rajinikanth and Nelson for Jailer's success. He called both of them and spoke about the film's performance and acceptance by the audience. Rajinikanth, meanwhile, is in the Himalayas and has not been a part of the film's success celebrations. The actor visited Badrinath on August 12 where he offered prayers. On August 14th, he was photographed at Dwarahat, Uttarakhand. According to figures shared by the Multiplex Association of India and the Producers Guild of India, the August 11-13 weekend has been the busiest weekend post-pandemic, with 2.10 crore admissions, which is also the highest combined admissions record in the last 10 years. Besides Jailer, Sunny Deol's Gadar 2 and Akshay Kumar's OMG 2 and Chiranjeevi's Bhola Shankar together earned Rs 390 crore in the period. Jailer has Rajinikanth essaying a man out to avenge the death of his cop son. The film has Mohanlal, Shivarajkumar and Jackie Shroff in important cameos. The action-packed entertainer also stars Priyanka Mohan, Tamannaah Bhatia, Ramya Krishnan, Yogi Babu, Vasanth Ravi and Vinayakan.",
      "url": "https://indianexpress.com/article/entertainment/tamil/jailer-box-office-collection-day-5-rajinikanth-film-rs-350-crore-mark-worldwide-independence-day-8893078/",
      "image": "https://images.indianexpress.com/2023/08/jailer-15082023.jpg",
      "publish_date": "2023-08-15 06:12:54",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.411
    },
    {
      "id": 136573805,
      "title": "‘My Love for Rajinikanth continues’: Japanese envoy Hiroshi Suzuki grooves to ‘Kaavaalaa’ song alongside YouTuber Mayo",
      "text": "It appears that Japanese Ambassador Hiroshi Suzuki’s fondness for Tamil superstar Rajnikant is only growing with time. On Wednesday, Suzuki shared a dance video alongside popular Japanese YouTuber Mayo, who is known for making videos about India and is fluent in Hindi. The duo danced to ‘Kaavaalaa’ number from Rajinikanth’s latest release Jailer. While sharing this clip, Suzuki wrote, “My Love for Rajinikanth continues …”. His video has over 12,000 likes so far. An X user wrote, “Ambassador of Japan to India wins Diplomat edition of #Kaavaalaa trend. Thank you @HiroSuzukiAmbJP for being such a great sport and embracing Indian culture.#Softpower. Thalaivar Rajinikanth's fandom has no boundaries ”. Echoing a similar sentiment, a person wrote, “Incredible to see you and Mayo san create magic through dance, blending #Kaavaalaa moves with Japanese flair. #Rajinikanth’s impact crosses oceans!”. Another person wrote, ‘Nicely done.These attempts are risky. Usually they end up cringe and offending the fans. But these folks have performed it elegantly and not making it look like they are mocking the video.” Previously, a day after Jailer’s release, the diplomat gave his best wishes to superstar Rajinikanth by sharing a video in which he is trying to learn Rajinikanth’s signature style of wearing sunglasses. Despite his best efforts, Suzuki fails to ace the trick but he nonetheless sends his wishes to the ‘Thalaivar’.",
      "url": "https://indianexpress.com/article/trending/trending-in-india/japanese-envoy-hiroshi-suzuki-dance-kaavaalaa-rajinikanth-8896536/",
      "image": "https://images.indianexpress.com/2023/08/Japanese-Hiroshi-Suzuki-Kaavaalaa-dance.jpg",
      "publish_date": "2023-08-17 09:20:53",
      "author": "Trends Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.333
    },
    {
      "id": 136822853,
      "title": "Jailer box office collection Day 8: Rajinikanth film smoothly sails into second week, earns Rs 470 crore worldwide",
      "text": "Superstar Rajinikanth has once again proved that finding a worthy successor who can replicate his box-office dominance remains elusive. Even during weekdays, his latest film Jailer, directed by Nelson Dilipkumar, continues to maintain a consistent and impressive performance in theatres. On Thursday, which marked the eighth day of its release, Jailer recorded India nett collection of Rs 10 crore, according to early estimates shared by industry tracker Sacnilk. This effectively pushed the actioner's first-week earnings in the domestic market to an impressive Rs 235.65 crore. Among the various iterations of Jailer, the Tamil version has so far amassed Rs 186.05 crore, the Telugu version Rs 46.99 crore, and both the Kannada and Hindi adaptations Rs 1.9 crore each. Jailer worldwide box office As per trade analyst, Manobala VIjayabalan, the gross worldwide collections of the film currently stand at Rs 470.17 crore. #Jailer WW Box Office Racing towards ₹5⃣0⃣0⃣ cr club. Week 1 - ₹ 450.80 cr Week 2 Day 1 - ₹ 19.37 cr Total - ₹ 470.17 cr ||#Rajinikanth | #ShivarajKumar | #Mohanlal|| pic.twitter.com/QkKJsCUXfq — Manobala Vijayabalan (@ManobalaV) August 18, 2023 According to Sacnilk’s forecast, the Rajinikanth movie is expected to garner domestic nett earnings of around Rs 12.79 crore on Friday. On Thursday, the Tamil actioner achieved a cumulative 32.70 per cent Tamil occupancy. Initially, during the morning shows, the movie witnessed a 19.37 per cent occupancy within the Tamil market. However, as the day unfolded, the percentages experienced a consistent increase: rising to 28.50 per cent during the afternoon showings, reaching 40.37 per cent during the evening shows, and peaking at 42.54 per cent for the night screenings. Currently, the sole significant contender that equals the remarkable box office triumph of Jailer is Sunny Deol's Gadar 2, which is dominating the box office in the northern states. Jailer has Rajinikanth essaying a man out to avenge the death of his cop son. The film has Mohanlal, Shivarajkumar and Jackie Shroff in important cameos. The action-packed entertainer also stars Priyanka Mohan, Tamannaah Bhatia, Ramya Krishnan, Yogi Babu, Vasanth Ravi and Vinayakan. Pointing out that Rajinikanth and Nelson Dilipkumar rediscover the alchemy of a good masala film with Jailer, The Indian Express’ Kirubhakar Purushothaman wrote in his review of the film: “Jailer is Rajinikanth’s version of Kamal Haasan’s Vikram, but with a twist. Saying that doesn’t take away anything from this fun-filled entertainer.”",
      "url": "https://indianexpress.com/article/entertainment/tamil/jailer-box-office-collection-day-8-rajinikanth-rs-470-crore-8897698/",
      "image": "https://images.indianexpress.com/2023/08/jailer-18082023.jpg",
      "publish_date": "2023-08-18 06:16:28",
      "author": "Nelson Dilipkumar",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.122
    },
    {
      "id": 137218103,
      "title": "Watch: Rajinikanth Touches Yogi Adityanath's Feet At His Home In Lucknow",
      "text": "Actor Rajinikanth has met Uttar Pradesh Chief Minister Yogi Adityanath at his residence in Lucknow. The actor arrived in the city on Friday night for the screening of his film 'Jailer', which was attended by UP Deputy Chief Minister Keshav Prasad Maurya. In a video, Rajinikanth was seen touching Yogi Adityanath's feet at his home in Lucknow. Meanwhile, Rajinikanth expressed his excitement about the kind of positive response his film is getting from the audience and its success. \"... It's God's blessing that the movie is becoming a hit,\" he told ANI. Earlier, Rajinikanth was in Ranchi, Jharkhand. He also visited the famous Chhinnamasta Temple in the state on Friday and offered prayers. He spent an hour meditating at 'Yagoda Ashram' in Ranchi. This was followed by his meeting with Jharkhand Governor C P Radhakrishnan at the Raj Bhavan. UP Deputy CM Keshav Prasad Maurya praised the actor for his acting skills and said, \"I also got a chance to watch a film titled 'Jailer'. I had watched Rajinikanth's many films and he is such a talented actor that even though there is not much content in the movie still he with his performance, he increases the importance of the film.\" 'Jailer,' which was released in theatres on August 10, has grabbed the box office by storm. In India, the film's eight-day total collection stood at Rs 235.65 crore (as of August 17). The film was released in several languages, including Tamil, Telugu, and Hindi. Rajinikanth plays a man seeking to avenge the death of his cop son in 'Jailer'. Mohanlal, Shivarajkumar, and Jackie Shroff are in important cameos.",
      "url": "https://www.ndtv.com/india-news/watch-rajinikanth-touches-yogi-adityanaths-feet-at-his-residence-in-lucknow-4312055",
      "image": "https://c.ndtvimg.com/2023-08/lts8mtt_rajinikanth-yogi-adityanath_625x300_19_August_23.jpg",
      "publish_date": "2023-08-19 18:22:00",
      "author": "UP Deputy Chief",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.441
    },
    {
      "id": 136614487,
      "title": "Jailer Star Rajinikanth Visits Ranchi After Himalaya Trip, Meets Jharkhand Governor",
      "text": "HomeEntertainmentJailer Star Rajinikanth Visits Ranchi After Himalaya Trip, Meets Jharkhand Governor Jailer Star Rajinikanth Visits Ranchi After Himalaya Trip, Meets Jharkhand Governor Ahead of the release of 'Jailer', the legendary actor went for a spiritual trip to the Himalayas. Asian News InternationalUpdated: Thursday, August 17, 2023, 04:24 PM IST Basking in the success of his latest release 'Jailer', megastar Rajinikanth on Thursday returned to Ranchi after offering prayers at Rajrappa Temple in Ramgarh. In the videos captured by the paparazzi, Rajinikanth can be seen dressed in traditional white attire. He waved at the paparazzi outside his hotel. Recently, Rajinikanth visited Badrinath Dham to take the blessings of Lord Badri Vishal. Let us know! ",
      "url": "https://www.freepressjournal.in/entertainment/jailer-star-rajinikanth-visits-ranchi-after-himalaya-trip-meets-jharkhand-governor",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/78ca91d8-037a-4b7b-9be5-35b462644451/Untitled_design___2023_08_17T162356_827.jpg",
      "publish_date": "2023-08-17 12:54:44",
      "author": "Asian News International",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.5
    },
    {
      "id": 137220595,
      "title": "Rajinikanth Touches Yogi Adityanath&#8217;s Feet At His Home In Lucknow",
      "text": "Actor Rajinikanth has met Uttar Pradesh Chief Minister Yogi Adityanath at his residence in Lucknow. The actor arrived in the city on Friday night for the screening of his film ‘Jailer’, which was attended by UP Deputy Chief Minister Keshav Prasad Maurya. Meanwhile, Rajinikanth expressed his excitement about the kind of positive response his film is getting from the audience and its success. “… It’s God’s blessing that the movie is becoming a hit,” he told ANI. Earlier, Rajinikanth was in Ranchi, Jharkhand. He also visited the famous Chhinnamasta Temple in the state on Friday and offered prayers. He spent an hour meditating at ‘Yagoda Ashram’ in Ranchi. This was followed by his meeting with Jharkhand Governor C P Radhakrishnan at the Raj Bhavan. UP Deputy CM Keshav Prasad Maurya praised the actor for his acting skills and said, “I also got a chance to watch a film titled ‘Jailer‘. I had watched Rajinikanth’s many films and he is such a talented actor that even though there is not much content in the movie still he with his performance, he increases the importance of the film.” ‘Jailer,’ which was released in theatres on August 10, has grabbed the box office by storm. In India, the film’s eight-day total collection stood at Rs 235.65 crore (as of August 17). The film was released in several languages, including Tamil, Telugu, and Hindi. Rajinikanth plays a man seeking to avenge the death of his cop son in ‘Jailer‘. Mohanlal, Shivarajkumar, and Jackie Shroff are in important cameos.",
      "url": "https://247newsaroundtheworld.com/news/rajinikanth-touches-yogi-adityanaths-feet-at-his-home-in-lucknow/",
      "image": "https://c.ndtvimg.com/2023-08/dn2022b_rajinikanth-yogi-adityanath_625x300_19_August_23.jpg",
      "publish_date": "2023-08-19 18:57:54",
      "author": "247 News Around The World",
      "language": "en",
      "source_country": "\r",
      "sentiment": 0.461
    },
    {
      "id": 136928443,
      "title": "Rajinikanth&#8217;s Jailer: All the box office records it has made and broken",
      "text": "Rajinikanth's Jailer has become one of the highest-grossing Tamil films in a matter of one week. While many such high-earning films take weeks to reach the spot, all it took for Rajinikanth-starrer was just a few days. Rajinikanth's fans initially were a bit sceptical about Nelson Dilipkumar directing their idol as the director had just turned out a damp squib, Vijay's Beast. However, the director has made a successful comeback with the film, which has earned Rs 450 crore worldwide in one week. The film has been breaking one box office record after the other ever since its release on August 10. Highest opening day collection for a Tamil film Before Jailer, Beast had the record of the highest opening day collection of Rs 35 crore, and Jailer beat it effortlessly by earning Rs 43 crore from across the world. While Beast and other big releases had early morning shows, Jailer didn't have such screening due to a new rule passed by the Tamil Nadu government. Fastest movie in the history of Tamil cinema to reach Rs 150-crore mark What's more impressive about Jailer is the pace at which the film is setting box office records! The film is now the fastest film in Tamil cinema history to cross Rs 150 crore in a matter of seven days. On day 7, the film earned Rs 159 crore, according to trade analysts. Previously, Ponniyin Selvan held the record by minting Rs 131 crore in a week. First Tamil film to touch Rs 400-crore mark in a week While it took four weeks for Kamal Haasan's Vikram to touch Rs 400-crore mark at the worldwide box office, Jailer pulled it off in a matter of a week. On day 7, the Rajinikanth-starrer crossed the milestone, earning Rs 411 crore, according to Sacnilk. Even Mani Ratnam's magnum opus Ponniyin Selvan managed to only mint Rs 324.05 crore in one week. Highest Tamil grosser of 2023 2023 already witnessed the release of big stars' films including Vijay and Ajith. In January, Thunivu and Varisu clashed at the box office with the latter emerging as the winner of the face-off. Varisu collected Rs 297.55 at the worldwide box office, while Thunivu managed to mint Rs 200 crore. However, Mani Ratnam's Ponniyin Selvan 2, which was released in April turned out to be the highest grosser by collecting Rs 345 crore (worldwide box office collection). Now, Jailer has broken all the records and has become the highest-grossing Tamil film of 2023. It has to be seen if Vijay's Leo, which will be released this year will end dethroning Jailer's record. Jailer records in other states According to trade analyst Ramesh Bala, the film is currently at the number two position in Kerala in terms of the highest box office collection for a Tamil film. \"It is at all-time number two in Kerala, and it will soon take down Vikram and become all-time number one in the state. In Karnataka, also it will soon become the highest-grossing Tamil film. In Telugu as well, the film should be in the second or third position,\" he said. Jailer's international box office records When asked about the performance of the film in the overseas market, he said, \"If you take the US, it is the all-time number two Tamil film. In the UK, it is behind only Ponniyin Selvan 1. In the Gulf region, like the UAE, it is now the highest-grossing Tamil film. Same case in Australie and New Zealand, where it is behind PS 1 and at the second position.\" Jailer's box office predictions The film is expected that the lifetime collection of the film will be around Rs 600 crore. \"2.0 had a good run in Hindi. Also, it was released in Russia as well. So, it was able to collect around Rs 700 to Rs 800 crore. However, Jailer will beat Ponniyin Selvan 1 collection and become the second highest-grossing Tamil film of all time,\" Ramesh said.",
      "url": "https://indianexpress.com/article/entertainment/tamil/rajinikanths-jailer-all-box-office-records-made-broken-8897944/",
      "image": "https://images.indianexpress.com/2023/08/Rajinikanth-in-Jailer.jpg",
      "publish_date": "2023-08-18 15:35:01",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.393
    },
    {
      "id": 136000223,
      "title": "&#8216;Jailer&#8217; Crosses ₹350 Crore Worldwide In 5 Days, Expected To Soar On I-Day",
      "text": "Superstar Rajinikanth’s latest movie “Jailer” has been a massive hit at the box office, crossing a whopping ₹350 crore in just five days globally. This success comes after his previous film “Annaathe” didn’t fare as well. “Jailer” is not only setting the box office on fire but also reaffirming Rajinikanth’s superstar status. Released on August 10 worldwide, the film has received positive feedback from both critics and audiences. The movie is bringing people back to theaters, with its collection slightly dropping on Monday, August 14, which is common for weekdays. Still, it managed to earn around ₹28 crore net at the Indian box office, taking its five-day total to ₹178.60 crore in India alone. Trade analyst Ramesh Bala revealed on Twitter that “Jailer” had surpassed ₹350 crore on August 14. The film is performing exceptionally well not only in India but also in overseas markets. Directed by Nelson Dilipkumar, “Jailer” is a commercial action entertainer starring Rajinikanth as Tiger Muthuvel Pandian. The film features Vinayakan, Ramya Krishnan, and Vasanth Ravi in lead roles. Notably, Mohanlal, Shiva Rajkumar, and Jackie Shroff also appear in exciting cameo roles. Produced by Sun Pictures, the movie has music composed by Anirudh Ravichander. The technical crew includes cinematographer Vijay Kartik Kannan and editor R Nirmal. ALSO READ: ‘Gadar 2’ Declared As A BlockBuster After Collecting ₹135 Crore The film’s success is anticipated to continue, with expectations that it will cross the ₹350 crore mark soon, especially with the Independence Day holiday boosting collections.The movie has gained huge positive reviews, marking Rajinikanth’s strong comeback to the big screen. It’s worth noting that “Jailer” has performed exceptionally well in foreign countries too, earning over ₹105 crore outside India.",
      "url": "https://indiaobservers.com/jailer-crosses-350-crore-worldwide-in-5-days-expected-to-soar-on-i-day/",
      "image": "https://indiaobservers.com/wp-content/uploads/2023/08/Jailer-Crosses-₹350-Crore-Worldwide-In-5-Days-Expected-To-Soar-On-I-Day.jpg",
      "publish_date": "2023-08-15 10:25:00",
      "author": "Cinemedia Reporter",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.467
    },
    {
      "id": 136235341,
      "title": "Jailer box office collection Day 6: Rajinikanth film eyes Rs 400-crore mark, among five biggest Tamil hits ever",
      "text": "Superstar Rajinikanth's latest release, Jailer, has swiftly proven his box office dominance by surpassing the Rs 200 crore mark in India within six days of its release. The movie's success is projected to propel it towards the Rs 400 crore mark globally. Only four films have previously gone past Rs 400 crore mark in the history of Tamil cinema - Rajinikanth's 2.O and Kabali, Ponniyin Selvan and Vikram. The film is expected to enter this hallowed club today. As per early estimates from industry tracker Sacnilk, Jailer, featuring Rajinikanth, earned around Rs 33 crore in India on Independence Day (August 15), boosting its net domestic earnings to Rs 207.15 crore. The film is recording the highest occupancy rate of 81.59 percent in Tamil Nadu. Considering its box office performance, Jailer is poised to outshine Mani Ratnam's Ponniyin Selvan: Part 1 collections in Tamil Nadu. This achievement would make Jailer the highest-grossing film in the state. Industry tracker Ramesh Bala echoed this sentiment, stating, \"#Jailer will beat #PS1 to become the Highest Grossing Movie in TN!\" #Jailer will beat #PS1 to become the Highest Grossing Movie in TN! — Ramesh Bala (@rameshlaus) August 15, 2023 In the Southern region, Jailer has been maintaining its momentum with minimal competition, as Chiranjeevi's recent release, Bhola Shankar, struggles at box office. In the Northern market, however, Jailer faces rivalry from Sunny Deol's Gadar 2, which has amassed Rs 229 crore in India since its release on August 11. Jailer, an action-packed entertainer, hit theatres on August 10. The film features explosive cameos from Shiva Rajkumar, Mohanlal and Bollywood actor Jackie Shroff. Its favourable reviews have undoubtedly contributed to its immense success. Kirubhakar Purushothaman of indianexpress.com gave the film 3.5 stars and wrote, \"Of course, Jailer’s story is similar to Kamal Haasan’s Vikram in a lot of ways, but this one is not too gloomy as Lokesh Kanagaraj’s film. Nelson’s film doesn’t hesitate to make fun of some of the most delicate situations, because all that matters to the director is to keep you entertained.\"",
      "url": "https://indianexpress.com/article/entertainment/tamil/jailer-box-office-collection-day-6-rajinikanth-film-eyes-rs-400-crore-mark-among-five-biggest-tamil-hits-ever-8894483/",
      "image": "https://images.indianexpress.com/2023/08/Jailer-4.jpg",
      "publish_date": "2023-08-16 05:48:54",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.315
    },
    {
      "id": 136527027,
      "title": "Jailer box office collection Day 7: Rajinikanth film earns Rs 450 crore worldwide in a week, fastest film in history to cross Rs 150 crore in Tamil Nadu",
      "text": "Rajinikanth-starrer Jailer, which was released on August 10, crossed the Rs 200 crore mark (domestic) on Independence Day, and on its seventh day in theatres, the film has managed to bring in Rs 15 crore across India, as per industry tracker Sacnilk. This takes the film's nett domestic collection to Rs 225.65 crore in one week. Jailer enjoyed a 42.43% occupancy on Wednesday. Jailer's box office journey started with a massive Rs 48.35 crore on opening day. On its second day, the film was expected to see some competition from Chiranjeevi's Bhola Shankar, but that didn't quite happen. While Jailer is enjoying a great run in the South states, the North states are being dominated by Sunny Deol-starrer Gadar 2, which has already become the second-highest Hindi grosser of the year, after Pathaan. As per trade analyst Manobala Vijayabalan, Jailer's worldwide gross collection currently stands at Rs 450.80 crore. The analyst claims that the film started its global box office journey by pulling in Rs 95.78 crore on its opening day. #Jailer WW Box Office ENTERS ₹450 cr club in just 7 days. Independence Week WINNER among #Gadar2, #OMG2, #BholaaShankar. ||#Rajinikanth | #ShivarajKumar | #Mohanlal|| Day 1 - ₹ 95.78 cr Day 2 - ₹ 56.24 cr Day 3 - ₹ 68.51 cr Day 4 - ₹ 82.36 cr… pic.twitter.com/mo3ULyUCAA — Manobala Vijayabalan (@ManobalaV) August 17, 2023 The film's earnings in Tamil Nadu currently stand at Rs 159.02 crore, making it the \"fastest ever in the history of Tamil Cinema to reach Rs 150 crore in just seven days,\" as per Manobala Vijayabalan. The Nelson Dilipkumar film, also starring Ramya Krishnan, Vinayakan, Yogi Babu and Mohanlal, released with a UA certificate and received a 3.5 star rating from indianexpress.com's Kirubhakar Purushothaman, who called it a \"good masala film.\" \"Nelson Dilipkumar film is Rajinikanth's version of Kamal Haasan's Vikram, but with a twist. Saying that doesn't take away anything from this fun-filled entertainer,\" read a part of the review.",
      "url": "https://indianexpress.com/article/entertainment/tamil/jailer-box-office-collection-day-7-rajinikanth-rs-450-crore-worldwide-8896147/",
      "image": "https://images.indianexpress.com/2023/08/jailer-5.jpg",
      "publish_date": "2023-08-17 05:26:03",
      "author": "Sunny Deol",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.356
    },
    {
      "id": 136662917,
      "title": "Japanese Ambassador Hiroshi Suzuki's Dance with YouTuber Mayo on Song 'Kaavaalaa' is Going Viral in India | WATCH VIDEO",
      "text": "In a delightful moment, the Japanese Ambassador to India, Hiroshi Suzuki, showcased his dance skills in a video that is now going viral. In the video, Ambassador Suzuki and Japanese YouTuber Mayo Sain can be seen dancing to the tune of the song 'Kaavaalaa,' with Ambassador Suzuki even emulating the iconic style of Rajinikanth, complete with his signature sunglasses. The 17-second dance clip was shared by Ambassador Suzuki himself on his official social media platform, where he also attempted to replicate Rajinikanth's famous sunglass pose.The video also features Japanese YouTuber Mayo Sain dancing alongside Ambassador Suzuki.Watch the video here on Since Independence:.What did Japanese Ambassador Write on X?In his post, Ambassador Suzuki expressed his admiration for Rajinikanth and even tagged him in the post, mentioning Rajinikanth's new film \"Jailer.\" He gave credit to the Japanese YouTuber Mayo Sain's team for the video..Japanese Foreign Minister also Praised Indian CinemaThe praise for Indian cinema wasn't limited to Ambassador Suzuki, as Japanese Foreign Minister Yoshimasa Hayashi, who participated in the India-Japan Forum in New Delhi last week, also expressed his appreciation for Indian movies. Hayashi said in response to a question that he enjoyed the film \"RRR\" during his flight from Tokyo to Delhi, mentioning his liking for actor Ram Charan Junior. .UP: Chaos Erupts During 'Gadar 2' Screening in Kanpur: AC Malfunction Sparks Altercation",
      "url": "https://www.sinceindependence.com/national/japanese-ambassador-hiroshi-suzukis-dance-with-youtuber-mayo-on-song-kaavaalaa-is-going-viral-in-india-watch-video",
      "image": "https://gumlet.assettype.com/sinceindependence/2023-08/a4b82036-9fb4-4029-8447-8b9ff9cb1af6/Japanese_Ambassador_Hiroshi_Suzuk_Dance.avif?w=1200&h=675&auto=format%2Ccompress&fit=max&enlarge=true",
      "publish_date": "2023-08-17 17:06:27",
      "author": "Ambassador Suzuki",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.63
    },
    {
      "id": 136952905,
      "title": "Rajinikanth To Watch His Latest Film 'Jailer' With Yogi Aditynath In Lucknow Tomorrow",
      "text": "Superstar Rajiniknath, whose latest 'Jailer' is already a box office hit, today said he will watch the movie tomorrow with Uttar Pradesh Chief Minister Yogi Adityanath. Rajinikanth, a Tamil superstar and one of Indian Cinema's tallest figures, arrived in Lucknow this evening. #WATCH | Actor Rajinikanth arrives in Uttar Pradesh's Lucknow, says, \"I will watch the film (Jailor) with the CM\". pic.twitter.com/wsBdkosu18— ANI (@ANI) August 18, 2023 \"I will watch the film with him,\" he told news agency ANI when asked about his meeting with the Chief Minister tomorrow. He also thanked God for the movie performing well at the box office. \"Sab Bhagwan ka dua hai (it's all god's blessings),\" he said as he boarded his car at the airport. 'Jailer', a Tamil movie, is the latest Rajinikanth-starrer to hit the screens after a two-year gap. Released last week, the film narrates how a jailer stops a gang from helping their leader flee the prison. The movie, which also stars Tamannaah and Jackie Shroff, has earned around Rs 375 crore worldwide in the first week, according to Sun Pictures.",
      "url": "https://www.ndtv.com/india-news/rajinikanth-to-watch-his-latest-film-jailer-with-yogi-aditynath-in-lucknow-tomorrow-4309714",
      "image": "https://c.ndtvimg.com/2023-08/2pscq9j_rajinikanth_625x300_18_August_23.jpg",
      "publish_date": "2023-08-18 17:57:59",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.316
    },
    {
      "id": 137080073,
      "title": "Jailer box office day 9: Rajinikanth starrer to cross Rs 500 crore mark worldwide today",
      "text": "Actor Rajinikanth's action entertainer Jailer has been attracting audiences for over a week now, and the ninth day was no different. As per trade website Sacnilk, Jailer made Rs 9 crore on its ninth day, with Tamil occupancy leading at 34.53 percent. The film's total India net collections stands at Rs 244.85 crore. Jailer managed to get Rs 235.85 crore in its first week, with Tamil audience bringing in Rs 184.65 crore, Telugu with Rs 47.05 crore, Kannada Rs 2.05 crore and Hindi adding Rs 2.1 crore to the first week's collection. The film's night shows in Tamil are of utmost importance as they are bringing in the maximum number, 54.59 percent occupancy. Jailer worldwide box office As per trade analyst Manobala Vijaybalan, the film is expected to touch Rs 500 cross globally on Saturday. He tweeted, \"#Jailer WW Box Office Week 1 - Rs 450.80 cr Week 2 Day 1 - Rs 19.37 cr Day 2 - Rs 17.22 cr Total - Rs 487.39 cr\". #Jailer WW Box Office Week 1 - ₹ 450.80 cr Week 2 Day 1 - ₹ 19.37 cr Day 2 - ₹ 17.22 cr Total - ₹ 487.39 cr All set to BREACH ₹5⃣0⃣0⃣ cr today. ||#Rajinikanth | #ShivarajKumar | #Mohanlal|| pic.twitter.com/0bFt5bAktr — Manobala Vijayabalan (@ManobalaV) August 19, 2023 Jailer continues to put up a strong fight against other releases across India like Gadar 2 and OMG 2. Chiranjeevi's Telugu offering Bholaa Shankar, which released a day after Jailer was expected to bring in some competition but Rajinikanth's film emerged as the clear winner. The Nelson Dilipkumar directorial also stars Tamannaah Bhatia in a pivotal role and tells the story of a man, who is out to avenge his cop son's death. The film also stars Mohanlal, Jackie Shroff and Shivarajkumar in significant roles. Besides them, the movie also features Priyanka Mohan, Ramya Krishnan, Yogi Babu, Vasanth Ravi and Vinayakan.",
      "url": "https://indianexpress.com/article/entertainment/tamil/jailer-box-office-day-9-rajinikanth-to-cross-rs-500-crore-today-8899231/",
      "image": "https://images.indianexpress.com/2023/08/Rajinikanth-R.jpg",
      "publish_date": "2023-08-19 05:21:35",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.139
    },
    {
      "id": 137385895,
      "title": "An Akhilesh Yadav-Rajinikanth Hug After Actor Touched Yogi Adityanath Feet",
      "text": "A day after superstar Rajinikanth was seen touching Uttar Pradesh Chief Minister Yogi Adityanath's feet at his home in Lucknow, Samajwadi Party boss Akhilesh Yadav today tweeted a picture of him hugging the south Indian megastar. In what is being seen as a swipe at the saffron-clad Chief Minister, he posted a \"when hearts meet\" message along with the picture. \"People hug when hearts meet,\" he wrote, adding that he feels as happy meeting the superstar now as he did when he saw him on screen while studying engineering in Mysuru. \"We met in a personal capacity nine years ago, and have been friends since,\" he added. जब दिल मिलते हैं तो लोग गले मिलते हैं।मैसूर में इंजीनियरिंग की पढ़ाई के दौरान पर्दे पर रजनीकांत जी को देखकर जितनी ख़ुशी होती थी वो आज भी बरकरार है। हम 9 साल पहले व्यक्तिगत रूप से मिले और तब से दोस्ती है… pic.twitter.com/e9KZrc5mNH— Akhilesh Yadav (@yadavakhilesh) August 20, 2023 He posted another picture of them sharing a laugh, sitting side by side at his residence. — Akhilesh Yadav (@yadavakhilesh) August 20, 2023 Rajinikanth met Yogi Adityanath at his residence in Lucknow on Saturday. The actor arrived in the city on Friday night for the screening of his film 'Jailer', which was attended by UP Deputy Chief Minister Keshav Prasad Maurya. UP Deputy CM Keshav Prasad Maurya praised the actor for his acting skills and said, \"I also got a chance to watch a film titled 'Jailer'. I have seen many of Rajinikanth's films, and he is such a talented actor that even though there is not much content in the film, still, with his performance, he elevates it.\" 'Jailer,' which released in theatres on August 10, is a box office hit. In India, the film's eight-day total collection stood at Rs 235.65 crore (as of August 17). The film was released in several languages, including Tamil, Telugu, and Hindi.",
      "url": "https://www.ndtv.com/india-news/akhilesh-yadav-meets-rajnikanth-yogi-adityanath-akhilesh-yadavs-hug-post-after-rajinikanth-gesture-for-yogi-adityanath-4312859",
      "image": "https://c.ndtvimg.com/2023-08/tr3dhbho_rajinikanth_625x300_20_August_23.jpg",
      "publish_date": "2023-08-20 08:52:00",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.726
    },
    {
      "id": 137402827,
      "title": "A bow for Yogi Adityanath, and a hug for Akhilesh Yadav; Ayodhya next: Rajinikanth on UP tour",
      "text": "Tamil superstar Rajinikanth, who is touring Uttar Pradesh to promote his film 'Jailer', met with Samajwadi Party leader Akhilesh Yadav on Sunday, a day after his 'courtesy meeting' with UP CM Yogi Adityanath. \"During my engineering studies in Mysore, the happiness I felt seeing Rajinikanth ji on the screen is still intact. We met in person 9 years back and have been friends ever since,\" Yadav wrote in a post on X (formerly Twitter) after the meeting at his residence in Lucknow. जब दिल मिलते हैं तो लोग गले मिलते हैं। मैसूर में इंजीनियरिंग की पढ़ाई के दौरान पर्दे पर रजनीकांत जी को देखकर जितनी ख़ुशी होती थी वो आज भी बरकरार है। हम 9 साल पहले व्यक्तिगत रूप से मिले और तब से दोस्ती है… pic.twitter.com/e9KZrc5mNH — Akhilesh Yadav (@yadavakhilesh) August 20, 2023 Meanwhile, Rajinikanth told reporters, “Nine years ago, I had met Akhilesh at a function in Mumbai. Since then, our friendship has continued, and we talk over the phone. I had come here five years ago for a shooting, (but) Akhilesh was not there, and (I) could not meet him. He is here now and I met him.\" On Saturday, the renowned actor met Chief Minister Yogi Adityanath at his residence in Lucknow. He was photographed touching the CM's feet. The veteran actor is also scheduled to visit Ayodhya on Sunday.",
      "url": "https://indianexpress.com/article/cities/lucknow/a-bow-for-yogi-adityanath-and-a-hug-for-akhilesh-yadav-ayodhya-next-rajinikanth-on-up-tour-8900759/",
      "image": "https://images.indianexpress.com/2023/08/rajini.jpg",
      "publish_date": "2023-08-20 10:59:55",
      "author": "Express Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.235
    },
    {
      "id": 135939017,
      "title": "Gadar 2 box office collection day 4: Sunny Deol film records biggest Monday collections of all time, nets a total of Rs 173 cr",
      "text": "Actor Sunny Deol's latest film Gadar 2 box office collection on Monday showed no signs of slowing down as it recorded mammoth numbers on its fourth day. After a weekend collection of Rs 134 cr, Gadar 2 continued its momentum and netted an estimated Rs 39 cr on Monday, industry tracker Sacnilk reported. With a huge Monday, Gadar's total box office collections are now Rs 173 cr- a figure which has surpassed expectations of many in the trade, who expected Gadar 2 to fire but certainly not with this intensity. Box Office India reported that the collections of the film on Monday will be an \"all-time record\" as even on holidays big films struggle to get 30 crore net. The four-day collections have now set the film for a massive Tuesday number on account of Independence Day. Gadar 2 is eyeing to clock at least Rs 55 cr on August 15, which would take its total to Rs 230 cr in five days, Sacnilk reported. Gadar 2 will manage these numbers despite a clash with Akshay Kumar fronted OMG2, which dented its showcasing. Gadar 2 will now challenge the lifetime total of Shah Rukh Khan’s Pathaan, which remains as the biggest Bollywood hit with collections of Rs 524 crore (Hindi) nett. Bollywood trade analyst Taran Adarsh is confident Gadar 2 will enter the Rs 200 crore club within the first week with a sizable ticket sales set to take place on the Independence Day. He had earlier tweeted, “It's crystal clear by now - if #Gadar2 was a solo release, NOT clashing with another #Hindi film - it would've easily added another ₹ 30 cr in its *weekend total*.\" TARA SINGH SMASHES THE #BO WITH HIS SLEDGE HAMMER… #Gadar2 creates #Gadar at the #BO… The GLORIOUS opening weekend proves, yet again, that *well-made* desi entertainers will never go out of fashion… All eyes on #IndependenceDay: Picture abhi baaki hain… Fri 40.10 cr, Sat… pic.twitter.com/hfDmrv0rPo — taran adarsh (@taran_adarsh) August 14, 2023 International magazine Deadline also mentioned the film's box office success and said international entertainers should be promoted as Hollywood reels from the impact of the ongoing SAG-AFTRA strike. The magazine named Gadar 2 and Rajinikanth's Jailer as good choices. The sequel to Gadar Ek Prem Katha, which emerged as a blockbuster in 2001, is set in 1971, amidst the backdrop of the partition of Bangladesh and East Pakistan. Directed by Anil Sharma, it also stars Ameesha Patel and Utkarsh Sharma in important roles. Gadar 2 has emerged as Sunny Deol's biggest hit in his 40-year career. It is also his first film to enter the Rs 100 crore club. In fact, seeing the unprecedented demand for the film, early morning and late-night shows were added in many parts of North India by exhibitors. Along with Rajinikanth's Jailer, Akshay's OMG 2, Chiranjeevi's Bhola Shankar, Gadar 2 contributed more than Rs 390 crore to the combined gross box office in theatres across India, the highest in the last 100 years. According to a joint statement by the Multiplex Association of India (MAI) and Producers Guild of India, over 2.10 crore moviegoers thronged the theatres, the highest number of admissions in the last decade.",
      "url": "https://indianexpress.com/article/entertainment/bollywood/gadar-2-box-office-collection-day-4-sunny-deol-film-highest-monday-collections-of-all-time-173-crore-independence-day-8893081/",
      "image": "https://images.indianexpress.com/2023/08/WhatsApp-Image-2023-08-15-at-8.34.52-AM.jpeg",
      "publish_date": "2023-08-15 05:20:38",
      "author": "Anil Sharma",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.183
    },
    {
      "id": 136286205,
      "title": "Kannada star Shivarajkumar elated as his performance in Jailer gets massive reception; Rajinikanth&#8217;s videos from Himalayan voyage go viral",
      "text": "Having swiftly surpassed the Rs 200-crore milestone in the domestic market within a mere six days, Nelson Dilipkumar’s Jailer, featuring superstar Rajinikanth in the lead role, is now poised to hit the Rs 400-crore mark at the global box office, positioning itself as one of the biggest releases of the year. While Rajinikanth's fans continue their exuberant celebrations of the movie, admirers of Kannada superstar Shivarajkumar are equally elated, stirred by the actor's impactful cameo appearance in the film, which resonated profoundly nationwide owing to its mass appeal. Despite his character being depicted in only two scenes, Shivarajkumar's portrayal of Narasimha instantly captured hearts, a testament to the actor's remarkable ability to seamlessly inhabit his roles. Opening up about his initial apprehension regarding the audience's reception of his performance, Shivarajkumar, fondly known as Shivanna among his fans, told Cinema Express that the feedback he received was both heartwarming and humbling. \"Since the movie's release, I've experienced a range of emotions. I was anxious about how my performance would be perceived. The audience's perspective remains a mysterious and unpredictable element.\" \"The way people have perceived me since the release of Jailer has been different. it is heartwarming and humbling. I'm thankful for the affection shown for my appearance in Jailer, and I give a significant portion of the credit to director Nelson and, most importantly, the legendary Rajinikanth.\" When questioned about his experience collaborating with stars from various industries in Jailer, Shivanna remarked, \"Working with Rajinikanth has truly been a unique experience for me. I have had the chance to meet him in more casual settings, and there exists a special bond that traces back to my younger days.\" \"When it comes to Ramya Krishnan, we have previously collaborated on a Kannada film. She exudes brilliance and versatility as an actor, boasting remarkable talent. I haven't had the opportunity to share screen space with Mohanlal, and even in Jailer, we didn't have scenes together. But I am absolutely enthusiastic about the prospect of collaborating with him in the future,\" he added. Shivarajkumar also pointed out that his favourite moments in Jailer are the scenes where Rajinikanth is depicted at home, interacting with the family and cherishing tender moments with his grandchild. \"This scene exemplifies Rajinikanth's unique ability to transcend his superstar persona and portray a genuine, relatable human on screen,\" he said. Superstar Rajinikanth's pictures from Uttarakhand go viral While the entire Team Jailer and his fervent fans rejoice in the remarkable triumph of the film, superstar Rajinikanth has distanced himself from the commotion, indulging in a period of spiritual seclusion in the Himalayas. இன்று மகாவதார் பாபாஜி குகைக்கு இரண்டு மணி நேரத்திற்கு மேல் மலையேறி நம் அன்புத் தலைவர் @rajinikanth அவர்கள் தியானம் செய்தார்! 49 ஆண்டுகளுக்கு முன் இந்த ஆகஸ்ட் 15ஆம் நாள் அவரது முதல் திரைப்படம் அபூர்வ ராகம் வெளியானது குறிப்பிடத்தக்கது. pic.twitter.com/Bfg4tR7SD8 — Ra.Arjunamurthy | ரா.அர்ஜூனமூர்த்தி (@RaArjunamurthy) August 15, 2023 யோகதா சத்சங்க ஆசிரமம் - துவாரஹதில் நம் அன்புத் தலைவர் @rajinikanth அவர்கள். pic.twitter.com/OYTACBYsCM — Ra.Arjunamurthy | ரா.அர்ஜூனமூர்த்தி (@RaArjunamurthy) August 14, 2023 இடம்: யோகதா சத்சங்க ஆசிரமம் - துவாரஹத் இன்று நம் அன்புத் தலைவர் @rajinikanth அவர்கள் யோகதா சத்சங்க ஆசிரமம் - துவாரஹாத்தில், ஸ்வாமிஜிகளுடன் இணைந்து இந்திய சுதந்திர தினத்தை முன்னிட்டு மூவர்ணக் கொடி ஏந்தி கொண்டாடினார்… pic.twitter.com/P5E7qMBKq4 — Ra.Arjunamurthy | ரா.அர்ஜூனமூர்த்தி (@RaArjunamurthy) August 14, 2023 சிரஞ்சீவி வியாசர் அவதரித்த “ஆடி”மாதத்தில் அவரின் இருப்பிடத்திற்கே சென்று அன்பு தலைவர் @rajinikanth அவர்கள் வணங்கியது ஆனந்தம்! pic.twitter.com/4pkfyN6hBS — Ra.Arjunamurthy | ரா.அர்ஜூனமூர்த்தி (@RaArjunamurthy) August 13, 2023 வியாசர் குகைக்கு அன்புத் தலைவர் @rajinikanth அவர்களின் வருகை! அத்தனை உயரத்தில் இருக்கும் மலையிலும் அவரின் பெருமை! pic.twitter.com/jCr6Cr8unV — Ra.Arjunamurthy | ரா.அர்ஜூனமூர்த்தி (@RaArjunamurthy) August 13, 2023 இந்த இளைஞர் சென்னையில் இருந்து மகாவதார் பாபாஜி குகைக்கு 55 நாட்கள் நடந்து சென்று நம் அன்புத் தலைவர் @rajinikanth அவர்களை சந்தித்தார். தலைவர் அவருக்கு பண உதவி செய்தார். மேலும் குளிர்ந்த காலநிலையில் ஒரு மரத்தடியில் தூங்கிக் கொண்டிருந்த அவரை இப்போது ஒரு சன்யாசியுடன் ஒரு சிறிய… pic.twitter.com/J5dR6gfm24 — Ra.Arjunamurthy | ரா.அர்ஜூனமூர்த்தி (@RaArjunamurthy) August 15, 2023 Rajini's associate Ra Arjunamurthy has been consistently sharing images and videos of the actor via his social media account. According to the updates, the Jailer actor visited Vyas Cave in the Chamoli district of Uttarakhand, commemorated Independence Day at Yogoda Satsanga Sakha Ashram in Dwarahat, and engaged in meditation at the cave of Mahavatar Babaji. Rajini also encountered a young man who embarked on a nearly 55-day journey from Chennai to Uttarakhand to meet him. In addition to offering financial assistance, the superstar also aided the young man in finding suitable accommodation, as he had been sleeping under a tree in the chilly weather. Jailer has Rajinikanth essaying a man out to avenge the death of his cop son. The film has Mohanlal, Shivarajkumar and Jackie Shroff in important cameos. The action-packed entertainer also stars Priyanka Mohan, Tamannaah Bhatia, Ramya Krishnan, Yogi Babu, Vasanth Ravi and Vinayakan.",
      "url": "https://indianexpress.com/article/entertainment/tamil/kannada-star-shivarajkumar-elated-performance-jailer-massive-reception-rajinikanth-videos-himalayan-voyage-8894707/",
      "image": "https://images.indianexpress.com/2023/08/Jailer-Rajini-Shiva.jpg",
      "publish_date": "2023-08-16 09:33:53",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.79
    },
    {
      "id": 136484641,
      "title": "Japan Ambassador Hiroshi Suzuki expresses his love for Rajinikanth's 'Jailer', hop on 'Kaavaalaa' song",
      "text": "Mumbai (Maharashtra) [India], August 17 (ANI): The'Jailer' song 'Kaavaalaa' featuring Tamannaah Bhatia and Rajinikanth has become very popular. After the video of a Japanese man dancing to the song went viral, now Hiroshi Suzuki, Ambassador of Japan to India created a video with Japanese YouTuber Mayo San in which he is seen shaking his legs on the track. Taking to X (formerly Twitter), he wrote in the caption,\"Kaavaalaa dance video with Japanese YouTuber Mayo san(@MayoLoveIndia) My Love for Rajinikanth continues ... @Rajinikanth Jailer rajinifans..Video courtesy: Japanese Youtuber Mayo san and her team\"Videos of many social media users dancing to this popular song have been posted online. Earlier also Suzuki posted a video in which he was seen flipping his glasses like Rajnikanth. He was seen taking the help of another person to do it in the right way. He wrote along with the video, Vannakkam!@Rajinikanth, Japan also loves you a lot!Jailer rajinifans\"Sung by Shilpa Rao and Anirudh Ravichander, the lyrics were penned by Arunraja Kamaraj. The dance moves of Tamannaah and Rajinikanth and the beats of the song from'Jailer' made it viral and trending. During the song launch, Tamannaah spoke about the song's success. She told ANI,\"People have given so much love. The song is trending so much that normally we promote films but now this song has promoted us so much that we literally have to come out and talk about the love that people have given us and made it a trend. Jailer of course is a film that has been dubbed in Hindi,Malayalam, Kannada, Tamil, and Telugu. So, it will; definitely reach out to. It's rooted Tamil film which hopefully will reach out to all the audience.\"Helmed by Nelson Dilipkumar, Rajinikanth plays the role of Jailer Muthuvel Pandian. The film is touted to be an action-packed entertainer and has a stellar star cast that includes Priyanka Mohan, Shiva Rajkumar, Jackie Shroff, Ramya Krishnan, Yogi Babu, Vasanth Ravi, Vinayakan in prominent roles. (ANI)",
      "url": "https://www.thejapannews.net/news/273934140/japan-ambassador-hiroshi-suzuki-expresses-his-love-for-rajinikanth-jailer-hop-on-kaavaalaa-song",
      "image": "https://cdn.bignewsnetwork.com/ani1692218828.jpg",
      "publish_date": "2023-08-17 01:23:58",
      "author": "Shilpa Rao",
      "language": "en",
      "source_country": "bh",
      "sentiment": 0.692
    },
    {
      "id": 136622657,
      "title": "\"Wanted to show our love for Rajini\", Japenese YouTuber Mayo shares her experience of shaking a leg to Rajni's 'Kaavaalaa'",
      "text": "New Delhi [India], August 17 (ANI): Mayo, a Japanese YouTuber who is a popular content creator, has expressed her love for India as her video dancing with Japanese Ambassador to India Hiroshi Suzuki to the tunes of Rajinikanth's hit song 'Kaavaalaa' from the film 'Jailer' goes viral. After the video of a Japanese man dancing to the song went viral, the Japanese envoy to India created a video with Japanese YouTuber Mayo in which he is seen shaking a leg to the track. During an exclusive conversation with ANI, YouTuber Mayo spoke about getting an education in Hindi and how she is fond of making videos in Hindi about Japan and India. While speaking to ANI, Mayo said that Rajinikanth is very famous in Japan and that she wanted to show her love for him. \"The Japanese ambassador used to make a lot of videos about India and Japan. We then decided to collaborate on the video. I suggested Rajinikanth's song when collaborating because he is well-known and popular in Japan. There are numerous die-hard Rajnikanth fans in Japan. We wanted to express ouraffection for him,\" said Mayo here. The 'Jailer' song 'Kaavaalaa' featuring Tamannaah Bhatia and Rajinikanth has become extremely popular and the Japanese Ambassador to India, who is a huge fan of Rajinikanth himself, decided to record his version of the dance. Taking to X (formerly Twitter), he wrote,\"Kaavaalaa dance video with Japanese YouTuber Mayo san(@MayoLoveIndia) My Love for Rajinikanth continues ... @Rajinikanth Jailer rajinifans..Video courtesy: Japanese Youtuber Mayo san and her team\"In the video, the Japanese Ambassador embraces the iconic dance steps from the song. Earlier, Hiroshi Suzuki expressed his love for superstar Rajini taking up the'Thalaivar Challenge' where he had to flip his glasses like Rajnikanth. He also wished Rajinikanth great success for the film. He wrote on X (formerly Twitter),\"Vannakkam!@Rajinikanth, Japan also loves you a lot!Jailer rajinifans\"\"I saw Ambassador earlier doing his famous flipping glass shot and assumed he too is a big Rajni fan. That's why I suggested it to him, and so we did it jointly,\" said Mayo. 29-year-old Mayo speaks Hindi fluently and loves eating'Pani Puri'. She studied Hindi at Osaka University and spent over a year in Delhi, Mayo fell in love with India while pursuing her studies. Mayo one of the most famous Japanese YouTubers blogs on food, pop culture, travel and other aspects of life in India and Japan. Mayo told ANI that she was inspired by her father, who loved climbing in the Himalayas and told her how he loved India. Revealing that'RRR' was a big hit in Japan, Mayo hoped that the cultural understanding can be deeper between both countries. \"I believe that cultural understanding between India and Japan may be improved. 'RRR' was a tremendous hit in Japan, and more and more Japanese people are falling in love with India. Most of them have never visited India, but they enjoy watching Indian entertainment. So I hope they visit Indiaand see the real India, and vice versa,\" said Mayo. Sung by Shilpa Rao and Anirudh Ravichander, the lyrics were penned by Arunraja Kamaraj. The dance moves of Tamannaah and Rajinikanth and the beats of the song from'Jailer' have made it viral and trending. (ANI)",
      "url": "https://www.thejapannews.net/news/273934557/wanted-to-show-our-love-for-rajini-japenese-youtuber-mayo-shares-her-experience-of-shaking-a-leg-to-rajni-kaavaalaa",
      "image": "https://cdn.bignewsnetwork.com/ani1692263455.jpg",
      "publish_date": "2023-08-17 13:48:53",
      "author": "Indian Air Force",
      "language": "en",
      "source_country": "bh",
      "sentiment": 0.518
    },
    {
      "id": 136686887,
      "title": "Kamal Haasan Wishes His Indian Director S. Shankar On His 60th Birthday",
      "text": "Kamal Haasan Wishes His Indian Director S. Shankar On His 60th Birthday HomeEntertainmentKamal Haasan Wishes His Indian Director S. Shankar On His 60th Birthday Kamal Haasan Wishes His Indian Director S. Shankar On His 60th Birthday The actor and director will be reuniting for Indian 2 IANSUpdated: Thursday, August 17, 2023, 10:27 PM IST Ahead of the release of his upcoming action-thriller film 'Indian 2', veteran actor Kamal Haasan wished director Shankar Shanmugam (or Shankar) on his 59th birthday. Taking to his X account (formerly Twitter), the 'Vikram' actor sharing a picture of the two together tweeted: \"Many happy returns of this day, Dear Shankar ji\". Many fans congratulated the veteran Tamil director on his birthday while referring to the two as the 'power-packed danger duo'. After his success with the 2022 version of his 1986 spy-thriller film 'Vikram', Kamal Haasan, who is now over 68 still has the same level of energy. Read Also Kamal Haasan Or Rajinikanth As Ken? AI Reimagines Tamil Superstars In Barbieverse 'Indian 2' is the sequel to Shankar Shanmugam's 1996 Tamil vigilante action classic 'Indian' which also starred Kamal Haasan in the lead alongside Nedumudi Venu, Sukanya, Manisha Koirala and Urmila Matondkar. The original movie followed the character of Senaputhy, a veteran freedom fighter from Netaji Subhas Chandra Bose' Indian National Army, who turns into a brutal vigilante to root out corruption and crime, all the while sitting on the crossroads against his own son who is at the opposite end of the spectrum. This time too, Kamal Hasaan will reprise his role as Senapathy and the movie will be set 26 years after the events of the first film, where Senapathy, though old, is still going strong on his mission. Read Also Friendship Day 2023: Mohanlal-Mammootty, Rajinikanth-Kamal Haasan, Chiranjeevi-Nagarjuna: 20 Magical... Shankar is one of Tamil film industry's most renowned directors, with his films typically focusing outside mainstream topics and instead hone in on issues related to corruption, crime, vigilantism, technology and more. He's also known for his use of VFX and practical effects in movies such as 'Enthiran', '2.0', 'Mudhalvan' and all three parts of the Vikram-starrer 'Anniyan' action-psychological-thriller trilogy. Most details for the film have been kept under the wraps, though it is posing itself as another brooding and dark film with Kamal Hasaan bringing out his full 'Vikram' energy. Read Also Video: Kamal Haasan Says He ‘Hated’ Sholay As Amitabh Bachchan Listens On Video Call At San... (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.) Follow us on RECENT STORIES Kamal Haasan Wishes His Indian Director S. Shankar On His 60th Birthday Arijit Singh Beats Taylor Swift & Billie Eilish To Become 3rd Most Followed Artist On Spotify Dulquer Salmaan: King Of Kotha Is A Very Story-Driven, Gangster Drama Designer Tarun Tahiliani Accuses Made In Heaven 2 Makers Of 'Breach Of Faith'; Here's Why Zoya Akhtar REACTS To Yashica Dutt's Claims Of Using Her Work Without Credit In MIH 2: 'Deeply...",
      "url": "https://www.freepressjournal.in/entertainment/kamal-haasan-wishes-his-indian-director-s-shankar-on-his-60th-birthday",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/d6aa732e-b259-405f-8826-8c437bdfb64d/1200_X_675.jpg",
      "publish_date": "2023-08-17 18:57:40",
      "author": "IANS",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.497
    },
    {
      "id": 136780133,
      "title": "Russia says 2 bombers performed planned flight over neutral Sea of Japan waters",
      "text": "Home Tokyo News International News Business News Search News Network Fri, 18 Aug 2023 «Back to Home Russia says 2 bombers performed planned flight over neutral Sea of Japan waters CGTN 15 Aug 2023, 15:28 GMT+10 Russia's defense ministry on Tuesday said two Russian strategic bombers carried out planned flights over neutral waters above the Sea of Japan, the RIA news agency reported. Source: CGTN Share article: More Japan News Access More Brigham researchers' AI model could aid in screening for heart defects The Japan News.Net US expected to expand South Korea and Japan security limit during trilateral summit The Japan News.Net \"Wanted to show our love for Rajini\", Japenese YouTuber Mayo shares her experience of shaking a leg to Rajni's 'Kaavaalaa' The Japan News.Net (MasterOfCrafts) Guixi copper engraving inheritor in east China's Jiangxi The Japan News.Net US Expected to Expand South Korea and Japan Security Links at Summit The Japan News.Net Reds shift course, designate RHP Luke Weaver The Japan News.Net Spain narrowly favored over England in Cup final The Japan News.Net UP Govt connects 1.5 crore families with tap water under Jal Jeevan Mission on I-Day The Japan News.Net North Korea Confirms It Is Investigating US Soldier Travis King The Japan News.Net Last 39 Nanjing Massacre survivors still waiting for apology The Japan News.Net U.S. dollar edges up after better-than-expected retail sales data The Japan News.Net How gender inequality is hindering Japan's economic growth The Japan News.Net China's current nuclear expansion underlines quest for status, says UK forum The Japan News.Net Human love of nature can be attributed to heredity and environment: Study The Japan News.Net Three female referees selected for 2023 FIBA World Cup The Japan News.Net Upgraded US-Vietnam partnership to help Hanoi escape China's influence The Japan News.Net Japan Ambassador Hiroshi Suzuki expresses his love for Rajinikanth's 'Jailer', hop on 'Kaavaalaa' song The Japan News.Net FIBA chief outlines fundamental vision to grow basketball worldwide The Japan News.Net War in Ukraine is a warning to China of the risks in attacking Taiwan The Japan News.Net India, Thailand race for spot on Asia's chipmaking map The Japan News.Net Here's what Antony Blinken replied when asked about his choice on 'Barbie' or 'Oppenheimer' The Japan News.Net Sign up for The Japan News a daily newsletter full of things to discuss over drinks.and the great thing is that it's on the house! Submit 27 ℃ Fair in Tokyo All Japan News Headlines We are confident to return to power again and KCR will become CM: KTR The Japan News.Net Archery World Cup 2023 stage 4: India's recurve teams win bronze medals The Japan News.Net Over 60 injured as Typhoon Lan moves north Japan The Japan News.Net US Women's Soccer Coach Resigns After Early World Cup Exit The Japan News.Net Durand Cup: Jamshedpur, Indian Navy seek first points, Indian Army take on Bodoland FC in their den The Japan News.Net Brigham researchers' AI model could aid in screening for heart defects The Japan News.Net How gender inequality is hindering Japan's economic growth The Japan News.Net US expected to expand South Korea and Japan security limit during trilateral summit The Japan News.Net China's current nuclear expansion underlines quest for status, says UK forum The Japan News.Net \"Wanted to show our love for Rajini\", Japenese YouTuber Mayo shares her experience of shaking a leg to Rajni's 'Kaavaalaa' The Japan News.Net Human love of nature can be attributed to heredity and environment: Study The Japan News.Net (MasterOfCrafts) Guixi copper engraving inheritor in east China's Jiangxi The Japan News.Net Three female referees selected for 2023 FIBA World Cup The Japan News.Net US Expected to Expand South Korea and Japan Security Links at Summit The Japan News.Net Upgraded US-Vietnam partnership to help Hanoi escape China's influence The Japan News.Net Reds shift course, designate RHP Luke Weaver The Japan News.Net Japan Ambassador Hiroshi Suzuki expresses his love for Rajinikanth's 'Jailer', hop on 'Kaavaalaa' song The Japan News.Net Spain narrowly favored over England in Cup final The Japan News.Net FIBA chief outlines fundamental vision to grow basketball worldwide The Japan News.Net UP Govt connects 1.5 crore families with tap water under Jal Jeevan Mission on I-Day The Japan News.Net War in Ukraine is a warning to China of the risks in attacking Taiwan The Japan News.Net North Korea Confirms It Is Investigating US Soldier Travis King The Japan News.Net India, Thailand race for spot on Asia's chipmaking map The Japan News.Net Last 39 Nanjing Massacre survivors still waiting for apology The Japan News.Net Here's what Antony Blinken replied when asked about his choice on 'Barbie' or 'Oppenheimer' The Japan News.Net U.S. dollar edges up after better-than-expected retail sales data The Japan News.Net Independence Day 2023: PM Modi congratulates countrymen for forming strong, stable govt The Japan News.Net Mystics, Ariel Atkins agree to multiyear extension The Japan News.Net Russia, North Korea Aim for Closer Cooperation The Japan News.Net Scheme for traditional craftsmen, expanding network of subsidised medicine outlets: PM Modi's announcements The Japan News.Net Durand Cup: Champions Bengaluru FC held by Indian Air Force football team The Japan News.Net Indian shooting squad embarks upon Baku world championship campaign The Japan News.Net China on track to become world's top car exporter Moody's The Japan News.Net World Insights: Why Japanese militarism should raise alarm bells The Japan News.Net Strong Tropical Storm Lashes Japan, Disrupts Holiday Travel The Japan News.Net Glover wins back-to-back, Matsuyama among five Asians qualify for second play-offs event The Japan News.Net Typhoon Approaches Japan, Threatens Heavy Rain, High Winds The Japan News.Net Independence Day 2023: A look at India's top 5 achievements in sports The Japan News.Net Independence Day 2023: Know the history, significance of Indian flag The Japan News.Net Jan Bhagidari: 1800 special guests from various walks of life to participate in I-Day celebrations at Red Fort The Japan News.Net Jan Bhagidari: Around 1,800 Special Guests from different walks of life to participate in I-Day celebrations at Red Fort The Japan News.Net Independence Day 2023: Get to know history, significance of Indian flag The Japan News.Net 77th Independence Day: Khadi weaver from Varanasi, to attend PM Modi's speech as special guest The Japan News.Net Varun Tej, Manushi Chhillar's film titled 'Operation Valentine' The Japan News.Net China needs to respect India's borders, says US Congressman Ro Khanna; highlights role of pluralism in democracy The Japan News.Net Canadian Open: Jessica Pegula overpowers Liudmila Samsonova to capture second WTA 1000 title The Japan News.Net North Korean leader slams \"irresponsible\" officials as typhoon Khanun hits North Korea The Japan News.Net India climbs to number 3 in FIH Men's Hockey Rankings following Asian Champions Trophy win The Japan News.Net Singapore is among top 10 most liveable cities in APAC, where do Indian cities rank? The Japan News.Net Lucas Glover continues improbable run with St. Jude playoff win The Japan News.Net Tokyo News Archery World Cup 2023 stage 4: India's recurve teams win bronze medals The Japan News.Net Over 60 injured as Typhoon Lan moves north Japan The Japan News.Net US Women's Soccer Coach Resigns After Early World Cup Exit The Japan News.Net Brigham researchers' AI model could aid in screening for heart defects The Japan News.Net How gender inequality is hindering Japan's economic growth The Japan News.Net US expected to expand South Korea and Japan security limit during trilateral summit The Japan News.Net Access More News Releases The Japan News.Net's News Release Publishing Service provides a medium for circulating your organization's news. Click For Details Twitter Feed Twitter International News Russia to deploy hypersonic missiles on new nuclear submarines The Japan News.Net Sicily's Catania airport closed by Mount Etna eruption The Japan News.Net Sons of Thai king depart after first visit in 27 years The Japan News.Net U.S., and NATO push to prolong war pressuring Ukraine The Japan News.Net Polish government plans referendum on accepting illegal immigrants The Japan News.Net Photos of Hong Kong pro-democracy publisher Jimmy Lai taken by AP The Japan News.Net Indiana woman imprisoned for COVID-19 fraud The Japan News.Net 10,000 more Polish troops to border with Belarus The Japan News.Net West warns ships to avoid Iranian waters over seizure threat The Japan News.Net US Sen. Manchin saud he could become independent, leave Democrats The Japan News.Net Access More The Japan News.Net SITE DATA Home About Us News Releases Contact Us Privacy Policy Terms and Conditions Archives Sitemap CONNECT Facebook Twitter Google+ RSS Contact Us © Copyright 1999-2023 The Japan News.Net - Mainstream Media Ltd. All rights reserved.",
      "url": "https://www.thejapannews.net/news/273935405/russia-says-2-bombers-performed-planned-flight-over-neutral-sea-of-japan-waters",
      "image": "https://static.themainstreammedia.com/story_logos/newsnet/the-japan-news.jpg",
      "publish_date": "2023-08-18 02:47:53",
      "author": "Indian Air Force",
      "language": "en",
      "source_country": "bh",
      "sentiment": 0.169
    },
    {
      "id": 137382737,
      "title": "5 Times Actors Touched Politicians Feet: SRK-Mamata Banerjee To Amitabh Bachchan-Balasaheb Thackeray",
      "text": "5 Times Actors Touched Politicians' Feet: SRK-Mamata Banerjee To Amitabh Bachchan-Balasaheb Thackeray By:FPJ Web Desk | August 20, 2023 South superstar Rajinikanth recently met UP CM Yogi Adityanath in Lucknow During their meet, he was seen greeting Adityanath by touching his feet While the pictures went viral within no time, this is not the first time that an actor was seen touching a politician's feet Amitabh Bachchan was quite close to Shiv Sena founder Balasaheb Thackeray and the two shared immense mutual respect Back in 2017, Shah Rukh Khan was seen touching West Bengal CM Mamata Banerjee's feet after she dropped him off at the Kolkata airport Sanjay Dutt was seen touching BJP leader Nitin Gadkari's feet out of love and respect at an event in 2022 Varun Dhawan, who is known for his respectful ways around seniors, touched BJP MP Hema Malini's feet at an awards show Thanks For Reading! WATCH: Superstar Rajinikanth Touches UP CM Yogi Adityanath's Feet Post-Special Jailer Screening Find out More",
      "url": "https://www.freepressjournal.in/ampstories/entertainment/5-times-actors-touched-politicians-feet-shah-rukh-khan-mamata-banerjee-to-amitabh-bachchan-balasaheb-thackeray",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/229d3eb1-fd9b-439e-8183-18fd7f7f8034/Untitled_design___2023_08_20T122944_899.jpg",
      "publish_date": "2023-08-20 09:12:14",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.527
    },
    {
      "id": 137422981,
      "title": "WATCH: Rajinikanth Offers Prayers At Ayodhyas Hanuman Garhi Temple, To Visit Ram Mandir Later",
      "text": "Rajinikanth jetted off to the Himalayas for his spiritual trip before the release of his film 'Jailer' (August 10), and he was spotted visiting several religious places in Uttarakhand, before landing in UP, via Jharkhand.",
      "url": "https://www.freepressjournal.in/entertainment/watch-rajinikanth-offers-prayers-at-ayodhyas-hanuman-garhi-temple-to-visit-ram-mandir-later",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/6f8a09e6-cc22-460a-9575-1a7e641291ac/Untitled_design___2023_08_20T164005_126.jpg",
      "publish_date": "2023-08-20 13:10:39",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.858
    },
    {
      "id": 137598167,
      "title": "OMG 2 box office collection Day 10: Akshay Kumar film holds its ground amidst Jailer-Gadar 2 rampage",
      "text": "In spite of Rajinikanth's Jailer and Sunny Deol’s Gadar 2 dominating the box-office scene and setting new records, Akshay Kumar's OMG 2 is consistently keeping up its pace and once again proved its appeal among audiences on Sunday. While both Jailer and Gadar 2 earned over Rs 40 crore on their respective release days, OMG 2 managed a more modest Rs 10.26 crore on its opening day (August 11). Although many initially doubted the potential of the Akshay Kumar comedy drama against these massive films, the movie has since maintained its momentum and is gradually carving out a successful trajectory, similar to that of a sleeper hit. On its 10th day in theatres on Sunday, OMG 2 collected approximately Rs 12.70 crore (nett), according to early estimates shared by industry tracker Sacnilk, representing a growth of 20.61 per cent compared to the earnings on Saturday. This has taken its overall India nett to Rs 114.31 crore. Simultaneously, the movie has achieved a global total of Rs 142 crore, propelled by a domestic gross of Rs 120 crore and an additional Rs 22 crore from overseas collections. Meanwhile, the film is expected to earn about Rs 3.35 crore (nett) on Monday. On Sunday, the Akshay Kumar comedy drama witnessed an overall 58.05 per cent Hindi occupancy. Helmed by Amit Rai, OMG 2 stars Pankaj Tripathi, Yami Gautam, and Pavan Malhotra in key roles, alongside Akshay. Initially, during the morning shows, the movie recorded a substantial 32.59 per cent occupancy within the Hindi market. As the day unfolded, the percentages experienced a consistent increase: rising to 64.89 per cent during the afternoon shows and reaching 76.73 per cent during the evening shows. However, the film saw a dip in the occupancy for the night screenings and recorded 58 per cent. On the other hand, while Rajinikanth's Jailer recorded an India nett of Rs 18.5 crore on Sunday, Sunny Deol’s Gadar 2 eked out a monumental Rs 41 crore. Previously, amidst widespread rumours regarding the film’s budget, where a segment of social media suggested it exceeded Rs 150 crore, Ajit Andhare, the Chief Operating Officer (COO) of Viacom18 Studios, which co-produced the movie alongside Cape of Good Films and Wakaoo Films, had dispelled these speculations and firmly stated that the circulating figures are far from accurate. “The reports of the budget of OMG 2 are grossly exaggerated. On the contrary, Akshay (Kumar) didn’t charge a rupee in fee and in fact, walked alongside us in both the financial and creative risk involved in such a courageous film,” Andhare told Pinkvilla. Awarding 3.5 stars out of 5, The Indian Express’ Shubhra Gupta wrote in her review of OMG 2: “It’s been a while since I enjoyed an Akshay Kumar performance as much as this one. And I haven’t been taken by surprise as much as I was in OMG 2, in the best way possible.” View this post on Instagram A post shared by Anupam Kher (@anupampkher) Anupam Kher calls OMG 2 'spectacular, stylish and very important' Renowned actor Anupam Kher recently watched OMG 2, and heaped praise on the film and actor Akshay Kumar. Labelling the film as spectacular, stylish and very important, Kher noted on social media while sharing a photo with Akshay: \"A film on #SexEducation with ease and wonderful aesthetics! It was houseful. Saw parents with their teenage children. Obviously the film has struck a chord with the audiences! Full marks to writer/director Amit Rai. Pankaj Tripathi is BRILLIANT. He makes acting look easy but I know there is huge preparation behind it. Yami Gautam is beautifully sharp & excellent. I loved Pavan Malhotra as the judge.\" He added, \"The film’s star undoubtedly is my friend & #GOAT",
      "url": "https://indianexpress.com/article/entertainment/bollywood/omg-2-box-office-collection-day-10-akshay-kumar-film-holds-its-ground-amidst-jailer-gadar-2-rampage-8901689/",
      "image": "https://images.indianexpress.com/2023/08/OMG2-21082023.jpg",
      "publish_date": "2023-08-21 05:51:43",
      "author": "Amit Rai",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.445
    },
    {
      "id": 135939015,
      "title": "OMG 2 box office collection day 4: Pankaj Tripathi-Akshay Kumar film delivers better Monday than opening Friday, earns Rs 54.6 cr",
      "text": "Despite strong competition, Oh My God 2 (OMG 2) pulled people to the cinema halls in huge numbers on its first Monday (non-holiday). OMG 2 box office collection on Monday stood at Rs 11.50 crore (early estimates) and the film crossed the Rs 50 cr mark within four days of its release, bringing its total collection to Rs 54.61 cr, reported Sacnilk. It has become the second film after The Kerala Story to have a Monday better than its opening Friday. The film starring Pankaj Tripathi and Yami Gautam, with an extended cameo by Akshay Kumar, had hit the theatres along with Sunny Deol's masala entertainer Gadar 2. Down south, Rajinikanth's Jailer was also released on the same day. So, before the release, the trade pundits were wary about OMG 2 picking up at the ticket counters. However, a positive word of mouth from the audience and film critics aided the film. Meanwhile, Gadar 2 is also maintaining its momentum at the box office and has earned Rs 39 cr on its first Monday. OMG 2 opened at the box office with a Rs 10.26 cr collection, followed by Rs 15.30 cr on Saturday and Rs 17.55 cr on Sunday. The film comes almost a decade after the first film in the franchise OMG, starring Paresh Rawal and Akshay, impressed the cinephiles. The film's success comes as a breather to Akshay, who has had a dry spell at the ticket counters since his last five films (Selfiee, Ram Setu, Raksha Bandhan, Samrat Prithviraj and Bachchhan Paandey) tanked at the ticket counters. Now, Tuesday (August 15) being a holiday, there are chances for OMG 2 to pick up pace and grow at the ticket counters. The film, which was awarded an A certificate, delivers a message about sex education. Watch the trailer of OMG 2 here Film critic Shubhra Gupta wrote in her review, “Entering ‘OMG 2,’ I held some apprehensions. Given the backdrop of 2023 and the complexities of today’s India, could a film navigate religious themes without taking a didactic or biased stance? The sequel tactfully avoids the complexities of diversity by embracing a remarkably progressive and liberal viewpoint. It compels us to overlook the absence of representation from other faiths. The result is a captivating film that challenges the skepticism uninformed adults harbor towards our youth, as they explore their bodies with natural curiosity and openness.\"",
      "url": "https://indianexpress.com/article/entertainment/bollywood/omg-2-box-office-collection-day-4-akshay-kumar-pankaj-tripathi-rs-54-crore-delivers-better-monday-than-opening-friday-8893100/",
      "image": "https://images.indianexpress.com/2023/08/omg-2-box-office.jpg",
      "publish_date": "2023-08-15 05:25:45",
      "author": "Akshay Kumar",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.329
    },
    {
      "id": 136223215,
      "title": "Japanese Man Dances To Tamannaah's 'Kaavaalaa' From The Film 'Jailer', Video Viral",
      "text": "The song 'Kaavaalaa' from the movie 'Jailer', starring Tamannaah Bhatia and Rajinikanth, has become a superhit, captivating the hearts of fans around the world.The dance moves featured in the song are being replicated in dance studios as both the film and the song continue to gain immense popularity. Tamannaah's appearance in the song is truly stunning, leaving a lasting impression. Numerous influencers on social media have shared videos of themselves dancing to this catchy tune. Now a new dance video related to this trending song has captured the attention of social media. In this video, a Japanese digital creator who goes by the name \"kaketaku\" has skillfully replicated Tamannaah's dance moves from the song. Kaketaku, who according to his Instagram bio is a dancer and choreographer, shared the video on Instagram with a caption that reads, \"Kaavaalaa from Japan.\" View this post on Instagram He went to great lengths to imitate the same dance steps that Tamannaah Bhatia performed in the movie. The dance clip was posted a week ago, and it received an overwhelmingly positive response from the internet, with many expressing their admiration for his performance. The video has garnered an impressive view count of nearly 200,000 on social media platforms. Since being posted, it has been liked more than 29,000 times, and the numbers are only increasing. Several users left interesting comments on the dance video. \"Myyy Gooodddd, Soooo Smooth, I Love Your Moves Bro, Keep Rocking, Lot's Of Love From Tamil Nadu,\" commented a user. \"Superb and killing moves,\" wrote another user. \"Totally different from real choreography,\" commented a third user.",
      "url": "https://www.ndtv.com/offbeat/japanese-man-dances-to-tamannaahs-kaavaalaa-from-the-film-jailer-video-viral-4301317",
      "image": "https://c.ndtvimg.com/2023-08/coi8q8g_kaketaku-dances-to-tamannaah-bhatia_625x300_16_August_23.jpg",
      "publish_date": "2023-08-16 04:42:00",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.755
    },
    {
      "id": 136226297,
      "title": "Gadar 2 box office collection day 5: Sunny Deol film delivers biggest Independence Day haul in history, scores its biggest single day",
      "text": "Gadar 2 is poised to become one of the biggest, if not the biggest, Hindi film in history. The long-awaited sequel to the hit 2001 film Gadar: Ek Prem Katha has been on a rampage at the box office, and is showing no signs of slowing down. In fact, it registered its biggest single-day haul yet on Independence Day, when it collected Rs 55 crore, according to industry tracker Sacnilk's early estimates. This is the biggest Independence Day haul in the history of Indian cinema. Gadar 2's box office collection now stands at Rs 229 crore in India. The film had an overall occupancy of 88% across the Hindi belt, which is extraordinary. Gadar 2 is mainly targetted at North Indian audiences, while Rajinikanth's Jailer does even better business in the South. Directed by Anil Sharma, Gadar 2 clashed against OMG 2 on Friday, and according to a Box Office India report, the film could have done even better business had it been a solo release. BOI said that Gadar 2 faced capacity issues on Independence Day, with several single screen theatres unable to accommodate demand. Even though additional shows have been added, the film is exceeding expectations at the box office. Gadar 2 made Rs 40 crore on day one, Rs 43 crore on day two, Rs 51 crore on day three, Rs 38 crore on day four, and Rs 55 crore on day five, for a combined nett total of Rs 229 crore in India. The film will overtake the lifetime haul of The Kerala Story next, and after that, will set its sights on beating the all-time Hindi record set by Shah Rukh Khan-starrer Pathaan earlier this year. The action film made Rs 543 crore nett in India, and over Rs 1000 crore worldwide. Trade analyst Taran Adarsh tweeted asking his followers whether Gadar 2 will surpass lifetime business of Pathaan and emerge the highest grossing film in India in terms of its nett collections. The first Gadar, also directed by Anil Sharma, was a blockbuster in 2001, when it clashed against the acclaimed hit Lagaan. It finished with Rs 130 crore at the global box office, a record that Gadar 2 eviscerated in days. The film features returning actors Sunny Deol, Ameesha Patel, Utkarsh Sharma, and is set against the backdrop of the 1971 India-Pakistan War. Meanwhile, OMG 2 is also performing well at the box office, and has crossed the Rs 50 crore mark already.",
      "url": "https://indianexpress.com/article/entertainment/bollywood/gadar-2-box-office-collection-day-5-sunny-deol-film-delivers-biggest-independence-day-haul-in-history-229-crore-8894450/",
      "image": "https://images.indianexpress.com/2023/07/gadar-2-1.jpg",
      "publish_date": "2023-08-16 05:10:16",
      "author": "Anil Sharma",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.049
    },
    {
      "id": 136229309,
      "title": "OMG 2 box office collection Day 5: Akshay Kumar film posts its highest earning on Independence Day; earns Rs 73.67 cr",
      "text": "The Akshay Kumar, Pankaj Tripathi and Yami Gautam starrer OMG 2 witnessed its best day in the theatres on Tuesday, which happened to be the Independence Day holiday across the nation. The film grew manifold from its first day and earned Rs 18.50 cr on Tuesday, reported industry tracker Sacnilk. Currently, the film's total collection stands at Rs 73.67 cr and going by its performance at the ticket counters, it might cross the Rs 100 cr mark by the coming weekend. OMG 2 had a slow start at the box office as it earned Rs 10.26 cr on Friday. But it started picking up pace with positive word of mouth and registered a weekend collection of Rs 32.85 cr (Rs 15.3 cr on Saturday and Rs 17.55 cr on Sunday). Also, the film's first Monday was better than its opening day as it collected Rs 12.06 cr. OMG 2 had hit the theatres along with the actioner Gadar 2, which had a huge craze around it even before release. But, much to the surprise of the trade analysts, both the films managed to survive in the theatres simultaneously. Along with them, Rajinikanth's Jailer is also writing new box office records every day. However, the real test of all three releases begins now when the Independence Day long weekend is over. The film, written and directed by Amit Rai, is the second film in the OMG franchise, which was loved by the audience. Noting the upward trend in the box office numbers of OMG 2, film trade analyst Taran Adarsh took to X (formerly Twitter) and wrote, \"Sure, #OMG is a brand, but the love #OMG2 is getting is reflecting in its #BO numbers… This franchise has only enhanced its status in the eyes and hearts of moviegoers.\" On Monday, the Multiplex Association of India (MAI) and Producers Guild of India (PGI) noted that the weekend which saw the release of OMG 2, Gadar 2 and Jailer, set a “new all-time theatrical gross box office record” in its 100 years of history. This came as a relief for the cinema exhibition industry which had been facing a difficult time since 2020 when the cinema halls were shut due to the coronavirus pandemic. Even after the reopening of the theatres, they found it tough to bring back people. However, it seems like the dry spell at the ticket counters is finally over.",
      "url": "https://indianexpress.com/article/entertainment/bollywood/omg-2-box-office-collection-day-5-akshay-kumar-film-posts-its-highest-earning-on-independence-day-earns-rs-73-67-cr-8894473/",
      "image": "https://images.indianexpress.com/2023/08/omg-2-box-office-1.jpg",
      "publish_date": "2023-08-16 05:16:53",
      "author": "Amit Rai",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.052
    },
    {
      "id": 136258647,
      "title": "Gadar 2 Records Highest Independence Day Box Office Collection In The History Of Indian Cinema",
      "text": "HomeEntertainmentGadar 2 Records Highest Independence Day Box Office Collection In The History Of Indian Cinema Gadar 2 Records Highest Independence Day Box Office Collection In The History Of Indian Cinema The total box office collection of Gadar 2 in just five days has mounted to Rs 229 crore. FPJ Web DeskUpdated: Wednesday, August 16, 2023, 10:48 AM IST The much-anticipated film Gadar 2 has kicked off a storm at the box office and Sunny Deol has hammered down all previous records as the film has scripted history within just five days of its release. Gadar 2, which has wrecked havoc in theatres, has emerged to be the biggest ever Independence Day grosser in the history of Indian cinema. Gadar 2 shows no signs of slowing down; instead, it is only gaining more frenzy as days pass by. The film, which has been on a rampage at the box office, has already minted over Rs 200 crore in India alone, and it is no hurry to let the buzz fizzle out. August 11, Friday, was the biggest opening day of the year with four films clashing at the theatre, and Gadar 2 has clearly emerged to be the winner. Read Also Gadar 2 Success Bash: Sunny Deol, Jeetendra, Rakesh Roshan & Others Celebrate In Mumbai Gadar 2 scripts history on Independence Day On the occasion of Independence Day on Tuesday, Gadar 2 recorded a whopping Rs 55 crore, it's highest ever single-day collection till date. And not just that, but with the staggering figure, the film has also emerged to have witnessed the biggest Independence Day haul in the history of Indian cinema. The total box office collection of Gadar 2 in just five days has mounted to Rs 229 crore. Gadar 2 has now become the second highest grosser of the year, the first one being Shah Rukh Khan's Pathaan, and if the current mania continues, then it would not be surprising if the Sunny Deol-starrer beats SRK's film too in the race. Read Also Sunny Deol On Gadar 2's Success: We Were Told That The Film Will Not Work About Gadar 2 Gadar 2 recorded the second highest opening of the year with Rs 40 crore on Friday, followed by Rs 43 crore on Saturday, Rs 51 crore on Sunday and Rs 38 crore on Monday. Gadar 2 brought back the iconic jodi of Sunny Deol and Ameesha Patel on the silver screens after over two decades. And it also introduced two new faces -- Utkarsh Sharma as Tara Singh's son and Simrat Kaur, his love interest in Pakistan. Directed by Anil Sharma, Gadar 2 has also become the biggest film of both Sunny and Ameesha's careers. Read Also 'I Was Stressed, Cried All Night': Sunny Deol Reacts To Box Office Success Of Gadar 2 (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.) Follow us on RECENT STORIES Gadar 2 Records Highest Independence Day Box Office Collection In The History Of Indian Cinema Fan Walks From Chennai To Uttarakhand To Meet Rajinikanth; Here's What The Superstar Did When They... Sonam Kapoor's Cryptic Post After Rana Daggubati Apologises For Recent Remarks About 'Wasting Time'... Uri Becomes First Hindi Film To Be Screened In Manipur After 23 Years Game of Thrones Actor Darren Kent Dies At 39",
      "url": "https://www.freepressjournal.in/entertainment/gadar-2-records-highest-independence-day-box-office-collection-in-the-history-of-indian-cinema",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/f9ce4048-c188-4ac2-a6a3-d84afc2f7b57/Untitled_design___2023_08_16T104641_638.jpg",
      "publish_date": "2023-08-16 07:18:55",
      "author": "Anil Sharma",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.008
    },
    {
      "id": 136302137,
      "title": "Mansoor Ali Khan: &#8216;In one film, my salary was 4 lakhs and Vijay&#8217;s was only 2&#8230; He has now come this far&#8217;",
      "text": "If the devil-may-care attitude had a face, it would look like Tamil actor Mansoor Ali Khan. The veteran actor, who was once a dreaded onscreen villain, is also known for adding sarcastic humour to his villain roles. Lokesh Kanagaraj once revealed that he wrote Kaithi with Mansoor Ali Khan as the protagonist, but the film later starred Karthi in the lead role. However, in Vijay's Leo, Mansoor is finally teaming up with Lokesh. In a recent interview, the actor shared his experience of working with Vijay. Leo is not the first collaboration between Vijay and Mansoor. He was part of Vijay's debut film Naalya Theerppu. Minsaara Kanna, Deva, Maanbumigu Manavan, and Sendhoorapandi are the other collaborations between the two actors. After a long time, Leo has brought them together. Talking about Vijay's formative years, Mansoor said, \"To be frank, back then for one film I was paid Rs 4 lakhs, and Vijay was paid only 2 lakhs. He has come from that stage because of his effort.\" He added, \"For him, it's all cinema. He shoots 40 takes for a dance step. If it had been me, I would dance twice and would have left saying that's all I can do. But Vijay is spending so much time on a single shot. They have sculpted Leo scene by scene.\" The actor also shared about working with Anurag Kashyap. \"I saw in papers that Anurag Kashyap wanted to act in Lokesh's film and die in it. A few days later, I see him sitting opposite me. He came and fired his gun 'tup tup'. Aiyayo (realises he is revealing too much about the film). Get lost man. I won't tell anything about Leo, go away.\" Mansoor also revealed why he missed out on acting in Kaithi. \"I was asked to meet SR Prabhu, the producer of Kaithi. Lokesh had told him that I should play the role. However, when the opportunity came my way, I was arrested (for protesting against a government scheme) and sent to Puzhal jail. They wouldn't have shared this detail for obvious reasons.\" Over the years, Mansoor Ali Khan has acted alongside all the top stars of Tamil cinema including Rajinikanth, Ajith Kumar, and Vijayakanth. He is noted for his roles in films like Minsaara Kanna, Naanum Rowdy Dhaan, Captain Prabhakaran, and Asuran.",
      "url": "https://indianexpress.com/article/entertainment/tamil/mansoor-ali-khan-in-one-film-my-salary-was-4-lakhs-and-vijays-was-only-2-he-has-now-come-this-far-8894843/",
      "image": "https://images.indianexpress.com/2023/08/Mansoor-Ali-Khan-in-Leos-Naan-Ready-Dhaan.jpg",
      "publish_date": "2023-08-16 10:25:54",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.004
    },
    {
      "id": 136335421,
      "title": "First Gadar, Now Gadar 2: Sunny Deol's Dhai Kilo Ka Haath Pounds Box Office",
      "text": "Gadar 2, starring Sunny Deol and Ameesha Patel, is absolutely destroying the Bollywood box office and truth be told, nobody's surprised. The film set expectations high even before it released with massive advance bookings and reality is matching up – unlike the Adipurush story, Gadar 2's ticket sales are on the uptick. The film raked in over Rs 55 crore on August 15, reported trade analyst Taran Adarsh - the biggest number notched up by an film so far on Independence Day. Gadar 2 has raced past the 200 crore mark on Day 5; its earnings at the end of Tuesday were over Rs 228 crore. Gadar 2 released last Friday with Akshay Kumar's OMG 2 – partly why it faced capacity issues on Tuesday. \"The demand is clearly more than the supply,\" Taran Adarsh wrote in his report. While Gadar 2 is the clear winner in this box office clash, OMG 2 has also performed exceptionally well – both films could have made more with solo releases, according to Mr Adarsh. See his posts here: CREATES HISTORY ON INDEPENDENCE DAY… Highest-ever biz on *15 August*… Yes, #Gadar2 hits the ball out of the stadium on #IndependenceDay… Fri 40.10 cr, Sat 43.08 cr, Sun 51.70 cr, Mon 38.70 cr, Tue 55.40 cr. Total: ₹ 228.98 cr. #India biz… BLOCKBUSTER RUN continues.#Gadar2… pic.twitter.com/u3jJZpa5Je— taran adarsh (@taran_adarsh) August 16, 2023 #OMG2 is trending EXCEPTIONALLY WELL, the jump on #IndependenceDay is an EYE-OPENER… Fri 10.26 cr, Sat 15.30 cr, Sun 17.55 cr, Mon 12.06 cr, Tue 17.10 cr. Total: ₹ 72.27 cr. #India biz… #OMG2 is displaying strong legs at the #BO.Let's face it, the clash with #Gadar2 has… pic.twitter.com/5LSs6GDtyT— taran adarsh (@taran_adarsh) August 16, 2023 PVR Cinemas has credited Gadar 2 as well as OMG 2, Rajinikanth's Jailer and Chiranjeevi's Bhola Shankar with crafting a record weekend in the century-long history of Indian cinema. Cinema is shattering records, and how! ",
      "url": "https://www.ndtv.com/entertainment/first-gadar-now-gadar-2-sunny-deols-dhai-kilo-ka-haath-pounds-box-office-4302467",
      "image": "https://c.ndtvimg.com/2023-08/5r9auvo_gadar1200_625x300_09_August_23.jpg",
      "publish_date": "2023-08-16 13:41:53",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.081
    },
    {
      "id": 136527035,
      "title": "OMG 2 box office collection Day 6: Akshay Kumar-starrer passes Rs 100 crore mark worldwide",
      "text": "The satirical comedy-drama OMG 2, featuring actor Akshay Kumarin an extended cameo, crossed the Rs 100 crore gross mark globally on Wednesday. After a decent Rs 10 crore opening, the film gained traction with positive word of mouth. It earned an impressive Rs 17 crore on Tuesday (Independence Day), and added Rs 7.75 crore on Wednesday, according to industry tracker Sacnilk. The total collection of the film now stands at Rs 80 crore. OMG 2 had an overall 30.69% Hindi occupancy on Wednesday Starring Akshay Kumar, Yami Gautam and Pankaj Tripathi, the film is helmed by Amit Rai. OMG 2 clashed with Sunny Deol’s Gadar 2, Rajinikanth’s Jailer and Chiranjeevi’s Bhola Shankar. Gadar 2, the sequel to Gadar: Ek Prem Katha, took the box office by storm after raking in Rs 40.10 crore on its opening day. #OMG2 is trending EXCEPTIONALLY WELL, the jump on #IndependenceDay is an EYE-OPENER… Fri 10.26 cr, Sat 15.30 cr, Sun 17.55 cr, Mon 12.06 cr, Tue 17.10 cr. Total: ₹ 72.27 cr. #India biz… #OMG2 is displaying strong legs at the #BO. Let’s face it, the clash with #Gadar2 has… pic.twitter.com/5LSs6GDtyT — taran adarsh (@taran_adarsh) August 16, 2023 OMG 2 is the sequel to the 2012 hit OMG - Oh My God! The new film has now earned the same amount as the first one. The original movie, starring Akshay Kumar, Paresh Rawal, and Mithun Chakraborty, collected Rs 81.46 crore during its run. OMG 2 is produced by Cape of Good Films, Ashwin Varde, Vipul D Shah and Rajesh Bahl. The Indian Express' Shubhra Gupta gave the film 3.5 stars. A part of the review read, “I went into OMG 2 with a great deal of trepidation. This is 2023, and a different India. It’s been a while since I enjoyed an Akshay Kumar performance as much as this one. And I haven’t been taken by surprise as much as I was in OMG 2, in the best way possible.”",
      "url": "https://indianexpress.com/article/entertainment/bollywood/omg-2-box-office-collection-day-6-akshay-kumar-starrer-passes-rs-100-crore-mark-worldwide-8896160/",
      "image": "https://images.indianexpress.com/2023/08/omg-1-1.jpg",
      "publish_date": "2023-08-17 05:34:54",
      "author": "Amit Rai",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.114
    },
    {
      "id": 136559611,
      "title": "Andhra Pradesh: Another leopard captured on Tirumala walkway, second in a week",
      "text": "A week after a 6-year-old girl was killed in a leopard attack on the Tirumala walkway in Andhra Pradesh, forest officials captured a second leopard from the area on Thursday morning. According to sources, the female leopard was trapped in a cage at the same spot where another leopard was trapped three days ago. They said cages were set up at three different spots, including Mokali Mitta, Lakshmi Narasimha Swamy Temple, and at the 35th turn atop the hill. A forest department official said the leopard was trapped in a cage that was set up at the Lakshmi Narasimha Swamy Temple in Tirupati. He said the authorities had trapped three leopards in 50 days. Tirupati Divisional Forest Officer (DFO) Satish Reddy said, “We found two leopards within a 500 m radius of the Lakshmi Narasimha Swamy Temple in a week and it was the third capture in 50 days.” He said they had moved another trapped leopard to the Sri Venkateswara Zoological Park in Tirupati three days ago, adding that trap cameras had been set up for leopards.He said the leopard got trapped in the cage at 2 am and was being moved to the SV Zoo. The senior forest official said veterinarians were checking if there was any human flesh in the freshly captured leopard’s stomach.He said the forest department will take a call on whether to keep it in the zoo or release it into the forest. “We have set up around 320 cameras to track leopards. Trap cameras have also been set up on the Srivari Mettu path (the shortest way to reach Tirumala on foot),” he said.Edited By: Poulami KunduPublished On: Aug 17, 2023ALSO READ | Rajinikanth's 'Jailer' beats Chiranjeevi's 'Bholaa Shankar' in Andhra Pradesh, TelanganaALSO READ | Schoolgirl suffers seizures, drowns in canal in Andhra Pradesh",
      "url": "https://www.indiatoday.in/india/story/andhra-pradesh-another-leopard-captured-on-tirumala-walkway-second-in-a-week-2422304-2023-08-17",
      "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/media_bank/202308/sri-venkateswara-zoological-park-170654-16x9.jpg?VersionId=ltc04ZrfQY5DIGOYqfHpB9RqTHVgtsPd?size=1200:675",
      "publish_date": "2023-08-17 08:21:55",
      "author": "Abdul BasheerApoo",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.824
    },
    {
      "id": 136614489,
      "title": "Pakistani Actress Mahira Khan To Get Married For The Second Time In September 2023: Reports",
      "text": "Pakistani Actress Mahira Khan To Get Married For The Second Time In September 2023: Reports HomeEntertainmentPakistani Actress Mahira Khan To Get Married For The Second Time In September 2023: Reports Pakistani Actress Mahira Khan To Get Married For The Second Time In September 2023: Reports Mahira Khan is all set to tie the knot with her longtime boyfriend Salim Karin in September 2023 FPJ Web DeskUpdated: Thursday, August 17, 2023, 04:32 PM IST Pakistani actress Mahira Khan will reportedly tie the knot with her longtime boyfriend Salim Karin in September 2023. Several media reports state that the intimate wedding ceremony will be attended only by their family members and close friends. The couple has decided to get married at a hill station in Pakistan's Punjab. However, the Raees actress has not commented on her wedding reports yet. Mahira and Salim have been spotted together at various events. However, they always remained tightlipped about their relationship. Read Also Pakistani actress Mahira Khan grooves to Ranbir Kapoor's Channa Mereya, netizens say 'Ex ki yaadein'... Reportedly, the actress spoke for the first time about her boyfriend during an Instagram LIVE, earlier this month. She said, \"There’s a line in Humsafar which I thought was beautiful, where Ashar says to Khirad, 'Pata nahi tum mujhe kis neiki kay badlay main miley ho'. I think the same about him.\" View this post on Instagram She was previously married to Ali Askari. However, they got divorced in the year 2015. Mahira and Ali have a son together. In 2017, Mahira was also rumoured to be dating Bollywood actor Ranbir Kapoor after their picture went viral in which they were seen smoking. Mahira made her Bollywood debut opposite Shah Rukh Khan in Raees in 2017. Due to a ban on Pakistani artistes in the Indian film industry, the actress could not promote the film in India. She has also not appeared in any other Indian projects since the ban. Read Also Mahira Khan opens up on intimate scenes with Shah Rukh Khan in Raees: 'Was scared kuch zyada na ho... (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.) Follow us on RECENT STORIES Pakistani Actress Mahira Khan To Get Married For The Second Time In September 2023: Reports Watch: Jad Hadid Slammed For Touching Akanksha Puri Inappropriately While Recreating Kiss Jailer Star Rajinikanth Visits Ranchi After Himalaya Trip, Meets Jharkhand Governor When Aamir Khan Spoke About Pay Parity In Bollywood: 'Heroines Work Hard But So Do Cameramen' Elvish Yadav Opens Up About His Mystery Girlfriend: 'She Is From Punjab",
      "url": "https://www.freepressjournal.in/entertainment/pakistani-actress-mahira-khan-to-get-married-for-the-second-time-in-september-2023-reports",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/723f37f9-0668-43f9-9a54-1d5be1318c3c/Screenshot_2023_08_17_162852.png",
      "publish_date": "2023-08-17 13:02:23",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.018
    },
    {
      "id": 136619817,
      "title": "Ambassador Of Japan To India Dances To 'Jailer' Song, Says 'My Love For Rajinikanth Continues' - Jammu Kashmir Latest News",
      "text": "New Delhi, Aug 17: Superstar Rajinikanth has a fan in Ambassador of Japan to India Hiroshi Suzuki, whose video of dancing to the actor’s song “Kaavaalaa” from his latest release “Jailer” is going viral on social media. Suzuki shared the 17-second clip on his official X page on Wednesday, in which he can be seen shaking a leg to the popular Tamil track — originally featuring Rajinikanth and Tamannaah Bhatia — with Japanese YouTuber Mayo. “Kaavaalaa dance video with Japanese YouTuber Mayo san (@MayoLoveIndia) My Love for Rajinikanth continues… @Rajinikanth #Jailer #rajinifans,” the ambassador captioned the post. Suzuki’s post has garnered close to 820,000 views and over 300 comments on the microblogging site. Mayo also shared the video on her official X page and thanked Suzuki for being such a sport. “Dance collaboration with Ambassador Suzuki at the Embassy of Japan in India. Ambassador Suzuki, you are wonderful! thank you very much!!” the influencer wrote in Japanese on X. Rajinikanth enjoys a massive fan following in Japan after a dubbed version of his 1995 Tamil film “Muthu” was released in 1998 and became a surprise hit at the box office there. The superstar has been popular in the country ever since. Recently, a Japanese couple visited Chennai during the “Jailer” release on August 10 to experience the festive mood that marks every Rajinikanth movie premiere in south. “Jailer” has minted Rs 375.40 crores in the first week of its release, according to production house Sun Pictures. The earnings were the “highest 1st week gross collection in the history of Tamil cinema”, the banner added in an X post. Directed by Nelson Dilipkumar, “Jailer” also features Vinayakan and Ramya Krishnan. (Agencies)",
      "url": "https://www.dailyexcelsior.com/ambassador-of-japan-to-india-dances-to-jailer-song-says-my-love-for-rajinikanth-continues/",
      "image": "https://cdndailyexcelsior.b-cdn.net/wp-content/uploads/2023/08/JAILER.jpg",
      "publish_date": "2023-08-17 13:11:21",
      "author": "Daily Excelsior",
      "language": "en",
      "source_country": "in",
      "sentiment": 1.0
    },
    {
      "id": 136625511,
      "title": "Chiranjeevi Undergoes Knee Surgery At A Private Hospital In Delhi, Takes 45-Day Break: Report",
      "text": "Chiranjeevi Undergoes Knee Surgery At A Private Hospital In Delhi, Takes 45-Day Break: Report HomeEntertainmentChiranjeevi Undergoes Knee Surgery At A Private Hospital In Delhi, Takes 45-Day Break: Report Chiranjeevi Undergoes Knee Surgery At A Private Hospital In Delhi, Takes 45-Day Break: Report The 67-year-old actor recently travelled to the USA with his family FPJ Web DeskUpdated: Thursday, August 17, 2023, 05:28 PM IST Megastar Chiranjeevi, who was last seen in Bholaa Shankar, successfully underwent a knee surgery in Delhi after returning from the US recently. According to a report in News18, the surgery was performed at a private hospital in Delhi. It involved addressing an infection in the kneecap. The actor has now taken a 45-day break for his speedy recovery. Chiranjeevi was concerned about his knee issues for a very long time and he finally decided to get the operation done. It was earlier reported that the surgery would take place in Bengaluru, however, the actor opted a hospital in the national capital. Read Also Gadar 2, OMG 2, Jailer & Bholaa Shankar Draw Over 2 Crore Viewers To Theatres In A Weekend For First... The 67-year-old actor recently travelled to the US with his family. Meanwhile, Chiranjeevi's latest film Bholaa Shankar hit the silver screens on August 11, 2023. The movie also features Keerthy Suresh, who plays the megastar's sister, and Tamannaah Bhatia, who is seen essaying the role of his lover. Directed by Meher Ramesh, the film created quite a buzz ahead of it's release in theatres. However, it failed to meet the expectations of the audiences. Bhola Shankar earned Rs 16 crore on the first day of its release and the total collection of the film stands at nearly Rs 27 crore. Bholaa Shankar is an official adaptation of the Tamil film Vedalam, which starred actor Ajith Kumar in the lead role. Read Also Superstar Chiranjeevi's Next Is Filmmaker Mallidi Vasishta's VFX Laden Supernatural Fantasy Film (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.) Follow us on RECENT STORIES Chiranjeevi Undergoes Knee Surgery At A Private Hospital In Delhi, Takes 45-Day Break: Report Pakistani Actress Mahira Khan To Get Married For The Second Time In September 2023: Reports Watch: Jad Hadid Slammed For Touching Akanksha Puri Inappropriately While Recreating Kiss Jailer Star Rajinikanth Visits Ranchi After Himalaya Trip, Meets Jharkhand Governor When Aamir Khan Spoke About Pay Parity In Bollywood: 'Heroines Work Hard But So Do Cameramen",
      "url": "https://www.freepressjournal.in/entertainment/chiranjeevi-undergoes-knee-surgery-at-a-private-hospital-in-delhi-takes-45-day-break-report",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/e70d1003-3b1e-4165-8a72-2f7286d30d63/Chiranjeevii.jpg",
      "publish_date": "2023-08-17 13:58:48",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.191
    },
    {
      "id": 136814451,
      "title": "Gadar 2 box office collection Day 7: Sunny Deol film crosses Rs 300 crore mark in India, to enjoy second successful weekend",
      "text": "Gadar 2, featuring Sunny Deol and Ameesha Patel in the lead roles, is asserting its dominance at the box office, consistently enticing thousands of film lovers to theatres even during weekdays, in stark contrast to the prevailing Bollywood trends observed since the Covid era commenced. The film's triumphant momentum shows no signs of waning, as it achieved a noteworthy collection of Rs 22 crore on its seventh day of release on Thursday, according to early estimates shared by industry tracker Sacnilk. With this, Gadar 2's total earnings in the domestic market have now reached an impressive nett earning of Rs 283.35 crore. The film's domestic gross collection stands at Rs 308.5 crore. The industry tracker has also predicted that the movie is poised to generate around Rs 17 crore on Friday, pushing it beyond the Rs 300-crore mark in the domestic market in just eight days. Gadar 2 records overall 35.06 per cent Hindi occupancy On Thursday, the period action drama also recorded an overall 35.06 per cent Hindi occupancy. While the film witnessed a 16.17 per cent occupancy in the Hindi market for morning shows, as the day progressed, the percentages steadily surged, reaching 29.20 per cent for afternoon shows, 41.77 per cent for evening shows, and 53.09 per cent for night shows. With no big releases on Friday, the film will enjoy another smooth weekend at the box office. While the film is still in its first week in theatres, it has already become the second-highest domestic grosser of the year, after Pathaan. Gadar 2 had earlier crossed The Kerala Story’s lifetime collection of Rs 242.20 crore. Gadar 2 was released on August 11 and started its box office journey with Rs 40.1 crore on its opening day. The film has been performing exceedingly well at the cinemas despite competition from Rajinikanth-starrer Jailer, Akshay Kumar's OMG 2, and Alia Bhatt-Ranveer Singh film Rocky Aur Rani Kii Prem Kahaani. Directed by Anil Sharma and bankrolled by Zee Studio and Anil Sharma Productions, Gadar 2 is the sequel to the 2001 hit Gadar, which was one of the highest grossers of that year.",
      "url": "https://indianexpress.com/article/entertainment/bollywood/gadar-2-box-office-collection-day-7-sunny-deol-rs-300-crore-8897650/",
      "image": "https://images.indianexpress.com/2023/08/gadar-2-18082023.jpg",
      "publish_date": "2023-08-18 05:23:50",
      "author": "Anil Sharma",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.275
    },
    {
      "id": 136846197,
      "title": "Akshay Kumar did OMG 2 for free, says producer Ajit Andhare: &#8216;Reports of film&#8217;s budget hugely exaggerated&#8217;",
      "text": "Even in the face of strong competition posed by Superstar Rajinikanth's Jailer and Sunny Deol’s Gadar 2, Akshay Kumar's OMG 2 is delivering an impressive box office performance, effectively bringing an end to the challenging phase that the Selfiee actor was experiencing. While Gadar 2 is clearly leading the box office charts in the northern states, OMG 2 has managed to amass an impressive nett total of Rs 84.72 crore domestically and a global collection of Rs 111.8 crore, according to industry tracker Sacnilk. Amidst widespread rumours regarding the film's budget, where a segment of social media suggests it exceeds Rs 150 crore, Ajit Andhare, the Chief Operating Officer (COO) of Viacom18 Studios, which co-produced the movie alongside Cape of Good Films and Wakaoo Films, has dispelled these speculations and firmly stated that the circulating figures are far from accurate. “The reports of the budget of OMG 2 are grossly exaggerated. On the contrary, Akshay (Kumar) didn't charge a rupee in fee and in fact, walked alongside us in both the financial and creative risk involved in such a courageous film,\" Andhare told Pinkvilla. \"We share a long history & understanding with him as a Studio since OMG, Special 26, and Toilet: Ek Prem Katha and I have been totally in lockstep with him in taking up scripts that are unconventional but stand for something larger and meaningful. Without him this risk was impossible to take, he was fully invested both creatively and financially,” he added. Helmed by Amit Rai, OMG 2 stars Pankaj Tripathi, Yami Gautam, and Pavan Malhotra in key roles, alongside Akshay Kumar. A big thank you to our audiences for all the love for #OhMyGadar and giving us the greatest week in Indian Film History! प्यार और आभार",
      "url": "https://indianexpress.com/article/entertainment/bollywood/akshay-kumar-did-omg-2-for-free-says-producer-ajit-andhare-shocking-revelation-8897782/",
      "image": "https://images.indianexpress.com/2023/08/omg-2-18082023.jpg",
      "publish_date": "2023-08-18 08:01:53",
      "author": "Amit Rai",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.566
    },
    {
      "id": 136856387,
      "title": "Rajinikanth Visits Rajrappa Temple In Jharkhand Post Jailer Success",
      "text": "Rajinikanth Visits Rajrappa Temple In Jharkhand Post Jailer Success By:IANS | August 18, 2023 Basking in the success of his latest film 'Jailer', superstar Rajinikanth recently visited Ranchi, Jharkhand, and met the state Governor C P Radhakrishnan Rajinikanth can be seen wearing a white shirt, and black joggers, paired with sports shoes The actor also visited the Rajrappa temple of Goddess Chinnamasta in Ranchi Several photos show Rajinikanth in a white kurta and matching lungi. He was accompanied by the priest of the temple, and police officers Few days back, the actor had also visited the Badrinath Temple in Uttarakhand to celebrate the success of his latest film 'Jailer' Directed by Nelson Dilipkumar, 'Jailer' has collected Rs 210.65 crore. Buoyed by Thalaiva's overseas fan following, the film's worldwide earnings have been pegged by the trade media at Rs 392.20 crore The film is facing competition in North India from the Sunny Deol-starrer 'Gadar 2' but looking at the trends, the Rajini cyclone seems poised to sweep the box-office completely The movie also marks a grand collaboration as Rajinikanth has worked for the first time with veteran Malayalam actor Mohanlal along with Bollywood star Jackie Shroff Thanks For Reading! Daler Mehndi Birthday: Revisit Iconic Songs - Tunak Tunak Tun, Bolo Ta Ra Ra, & More Find out More",
      "url": "https://www.freepressjournal.in/ampstories/entertainment/rajinikanth-visits-rajrappa-temple-in-jharkhand-post-jailer-success",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/b10e02ca-4016-47b8-b81b-492c92aef4cd/F3uDznmaIAAfoDl.jpg",
      "publish_date": "2023-08-18 09:09:12",
      "author": "IANS",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.639
    },
    {
      "id": 136902345,
      "title": "Workers In India Are Getting The Day Off To See A New Hit Film - WorldNewsEra",
      "text": "Box office numbers can only tell you so much about a film’s success. Sure, you get the hard dollar amounts. But ticket sales alone can’t justify cultural movements. RRR, the South Indian film that rode an international wave of success to an Oscars win for best Original Song, could be seen in its home country for 75 rupees (just under one US dollar). With ticket prices like that, you’re not going to top the worldwide box office. And yet, RRR still became the 31st highest-grossing film of 2022 once it hit international theaters. Now, India has another massive success on their hands. Jailer, a Tamil-language action film starring legendary Indian actor Rajinikanth, is so popular that workers are being given the day off by their employers to go and see the film. According to CNN, an education company called Redbooks Abroad even bought their entire staff tickets. “We hope that this day off and movie experience will bring joy, relaxation, and renewed energy to you all. Let us cherish this moment and create memories together,” an internal memo read. “Relax, rejoice, and immerse yourselves in the magic of the silverscreen.” Le Hive, a restaurant in Tamil Nadu, joked that they also gave their staff half the day off to, “avoid sudden sick leaves.”",
      "url": "https://worldnewsera.com/news/entertainment/workers-in-india-are-getting-the-day-off-to-see-a-new-hit-film/",
      "image": "https://hips.hearstapps.com/hmg-prod/images/fans-of-indian-film-actor-rajinikanth-cheer-and-whistle-news-photo-1691782171.jpg",
      "publish_date": "2023-08-18 13:25:09",
      "author": "Ashleigh Durden",
      "language": "en",
      "source_country": "us",
      "sentiment": 0.246
    },
    {
      "id": 136914295,
      "title": "Nora Fatehi Amps Up Her Look With ₹2.10 Lakh Mini Backpack [PHOTOS]",
      "text": "Nora Fatehi Amps Up Her Look With ₹2.10 Lakh Mini Backpack [PHOTOS] By:FPJ Web Desk | August 18, 2023 Actress and dancer Nora Fatehi was spotted on Friday (August 18) as she stepped out of her dance class in Mumbai Photos by Varinder Chawla Nora often makes heads turn with her stylish appearances. Earlier today, she wore a white tank top and comfy pink pants Nora completed her look with black sunglasses and sneakers. She tied her hair in a loose bun Nora amped up her casual look with a mini leather backpack. After doing a little research, we found out that the price of the Louis Vuitton bag is Rs 2.10 lakh Besides being an actress and one of the best dancers in Bollywood, Nora is also recognised for her sense of style and fashion The fashionista often makes headlines for her sartorial choices. She experiments with different colors, patterns, and silhouettes, showcasing her versatility in fashion Meanwhile, on the work front, Nora will next be seen in films like 100%, Madgaon Express, Dancing Dad and Matka Thanks For Reading! Rajinikanth Visits Rajrappa Temple In Jharkhand Post Jailer Success Find out More",
      "url": "https://www.freepressjournal.in/ampstories/entertainment/nora-fatehi-amps-up-her-look-with-210-lakh-mini-backpack-photos",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/6a792a9c-1bb0-423d-9e73-8df362c712de/Untitled_design___2023_08_18T172653_895.jpg",
      "publish_date": "2023-08-18 14:18:04",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.682
    },
    {
      "id": 136932421,
      "title": "Tamannaah Bhatia Nails Monochromatic Power Dressing In Bold Pantsuit: See Photos",
      "text": "Tamannaah Bhatia Nails Monochromatic Power Dressing In Bold Pantsuit: See Photos By:FPJ Web Desk | August 18, 2023 Tamannaah Bhatia grabbed eyeballs with her striking monochromatic pantsuit ensembleas she steeped out in the city. The ‘Boss Lady’ clearly showcased herself as the epitome of power dressing. The actress dons a sleek brown pantsuit, embracing the shirtless trend with a sophisticated blazer, waistcoat, and matching pants. Tamannaah's blazer features shawl lapel collars, full-length sleeves, pockets, a plunge V neckline, and a figure-flattering fit, exuding boldness and confidence. The blazer is paired with flared-leg pants, creating a harmonious silhouette that radiates elegance and modern charm. Keeping it understated, Tamannaah opts for subtle black and white heels and elegant earrings, allowing her outfit to take center stage. With her tresses left down and subtle makeup, Tamannaah's pink lips stand out, adding a touch of vibrancy to her chic ensemble. Tamannaah's recent song \"Kaavaalaa\" from the movie \"Jailer\" has become a social media chartbuster, showcasing her exceptional dance moves and expressions. Apart from her musical success, Tamannaah's role in the Rajinikanth starrer \"Jailer\" has garnered significant acclaim, contributing to the film's record-breaking success at the box office. Thanks For Reading! BTS' J-hope Shares NEW Photos From Military; Check Out Find out More",
      "url": "https://www.freepressjournal.in/ampstories/entertainment/tamannaah-bhatia-nails-monochromatic-power-dressing-in-bold-pantsuit-see-photos",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/cabb332b-6c0f-49ab-90df-86ac5035ab8e/F3z553PXoAAdWyn.jpg",
      "publish_date": "2023-08-18 15:54:28",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 1.0
    },
    {
      "id": 136940221,
      "title": "Karan Johar&#8217;s Rocky Aur Rani Kii Prem Kahaani touches Rs 300 cr globally, director says he is &#8216;humbled and grateful&#8217;",
      "text": "Actors Ranveer Singh and Alia Bhatt's family drama Rocky Aur Rani Kii Prem Kahaani has crossed the Rs 300 crore mark globally. Karan Johar's return to the (feature film) director's chair after seven years is being met with generosity and excitement by the audience, with the film delivering strong collections ever since it released on July 28. The filmmaker took to his Instagram account to spread the happy news. Rocky Aur Rani Kii Prem Kahaani also stars Dharmendra, Jaya Bachchan, Shabana Azmi, and Bengali actor Tota Roy Chowdhury. The film created a lot of buzz for being a quintessential Karan Johar film, with all his favourite elements of drama and grandeur. The film has so far collected Rs 140.02 crore net in India. Karan took to Instagram on Friday and posted a video announcing the Rs 300 cr milestone. In the caption, he wrote, \"To know that our prem kahaani has reached the corners of the world and hearts…feeling humbled & grateful and especially for all the love you have given to #RockyAurRaniKiiPremKahaani!!! Thank you.\" Check out Karan Johar's post - View this post on Instagram A post shared by Karan Johar (@karanjohar) Rocky Aur Rani Kii Prem Kahaani follows the love story of two mismatched characters. However, the cultural and social differences between them and their families pose an obstacle. The two then come up with the plan of swapping families for a few months to understand each other's lifestyles and values. The film enjoyed a solid run for two weeks, despite Hollywood films Oppenheimer and Barbie already dividing box office numbers from the previous week, and big-ticket titles such as Sunny Deol's Gadar 2, Akshay Kumar's OMG 2, Rajinikanth's Jailer, and Chiranjeevi's Bholaa Shankar, taking up a lot of screens two weeks later. Rocky Aur Rani Kii Prem Kahaani marks the return of Karan Johar as a feature film director after seven years. His last full length directorial was Ae Dil Hai Mushkil.",
      "url": "https://indianexpress.com/article/entertainment/bollywood/karan-johar-rocky-aur-rani-kii-prem-kahaani-touches-300-cr-globally-director-is-humbled-grateful-8898704/",
      "image": "https://images.indianexpress.com/2023/08/Untitled-design-2023-08-18T185909.751.jpg",
      "publish_date": "2023-08-18 16:32:53",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.638
    },
    {
      "id": 137024525,
      "title": "Whatever Happened To The Cast Of Dirty Dancing?",
      "text": "Whatever Happened To The Cast Of Dirty Dancing? - 247 News Around The World Entertainment Whatever Happened To The Cast Of Dirty Dancing? Published on 18 August 2023 Author 247 News Around The World Dirty Dancing is one of the most iconic movies of the 1980s, but much of its cast has moved far away from the spotlight in the decades since. Post source: The List You May Also Like Entertainment 111 Credit: Faye’s Vision/Cover Images Kyle Richards may be continuously shutting down… 247 News Around The World August 18, 2023 Entertainment The combined performances of Rajinikanth’s “Jailer,” Sunny Deol’s “Gadar 2,” Akshay Kumar’s… 247 News Around The World August 18, 2023 Entertainment Alison Sweeney’s exit from “Days of Our Lives” also gave her more… 247 News Around The World August 18, 2023 Entertainment It would come as no surprise to learn that “Back on the… 247 News Around The World August 18, 2023 News The 19 People Charged in Georgia Election Interference Case | Time Connect… 247 News Around The World August 18, 2023 Crime Ministers tonight ordered an urgent inquiry into the shocking failings that allowed… 247 News Around The World August 18, 2023 Celeb gist Khloe Kardashian seems to be unwinding during her summer vacation in Italy. On… 247 News Around The World August 18, 2023 Trending To fans of Ahsoka’s original incarnation, Rosario Dawson’s version can seem… 247 News Around The World August 18, 2023",
      "url": "https://247newsaroundtheworld.com/entertainment/whatever-happened-to-the-cast-of-dirty-dancing/",
      "image": "https://www.thelist.com/img/gallery/what-happened-to-the-cast-of-dirty-dancing/intro-1692135304.jpg",
      "publish_date": "2023-08-19 00:04:55",
      "author": "247 News Around The World",
      "language": "en",
      "source_country": "\r",
      "sentiment": 0.377
    },
    {
      "id": 137054691,
      "title": "Aditi Govitrikar On Juggling Multiple Careers: ‘My Focus Has Been On My Skills & Passion’",
      "text": "Aditi Govitrikar On Juggling Multiple Careers: ‘My Focus Has Been On My Skills & Passion’ HomeEntertainmentAditi Govitrikar On Juggling Multiple Careers: ‘My Focus Has Been On My Skills & Passion’ Aditi Govitrikar On Juggling Multiple Careers: ‘My Focus Has Been On My Skills & Passion’ Aditi Govitrikar gets candid about her journey in the world of showbiz, and more Oshin FernandesUpdated: Friday, August 18, 2023, 10:07 PM IST Aditi Govitrikar On Juggling Multiple Careers: ‘My Focus Has Been On My Skills & Passion’ | Aditi Govitrikar who is currently heading the beauty pageant Marvelous Mrs India took the entertainment industry by storm when she became the first Indian woman to win the Mrs World title in 2001. Aditi has worked in films like 16 December, Paheli, De Dana Dan, and Koi Jaane Na to name a few. She has also been featured on the web series Mismatched. She can easily be defined as “beauty with brains”. Besides being an actress, she is also a doctor by profession. However, nothing compares to her role as a hands-on mother. In an exclusive chat with The Free Press Journal, Aditi opens up about her journey in showbiz. You have an envious bio. What is your secret to maintaining a work-life balance? It’s a constant effort to find balance even today, as there’s no one-size-fits-all solution, but a few key principles have helped me. Maintaining any kind of balance requires prioritisation, time management, delegation, self-care, communication, flexibility, saying no when necessary, setting realistic goals, mindfulness, and a strong support system from family and friends. Although I still have my days, I continue to learn and adjust as needed. View this post on Instagram Was your family supportive of entering the modelling world despite being a doctor? Yes, after the initial surprise of entering an industry, I never thought I would, my parents were surprisingly cool about it. They were and still are very supportive and motivating of everything I pursue. Do you think it was a risky move to enter showbiz? Yes and no. I mean, entering showbiz is indeed a risky move due to the competitive nature of the industry, unpredictable opportunities, and the need to navigate constant public scrutiny. But like any other field, it requires a strong sense of resilience, the will to continuously adapt, and handle both successes and setbacks. Despite the risks though, for those with a passion and a drive to succeed, like me, the personal growth and success I earned through my journey made it a worthwhile pursuit. View this post on Instagram Did you encounter any rejections along the way? Not really, my experience in the entertainment industry has been largely positive, albeit with some challenges along the way. As for rejections, they are a common part of the industry, but I always believe in persevering so that never phased me. Luckily, I’ve always been confident in my natural self and my focus has been on my skills and passion so, it helped me sail right through. Reality shows these days are completely different from the ones you've participated in. Your thoughts? Absolutely! Reality shows have undergone a significant transformation from when I participated. The influence of social media has revolutionised reach and fan engagement. It’s exciting to see the instant connection, but it also means being prepared for a more dynamic and media-savvy experience, including both positive and negative reviews and comments, which is definitely kinda scary however, the evolving landscape demands adaptability from both participants and the industry. You’re using social media to empower your followers, a bit different from your contemporaries. What made you take an unusual route? Absolutely, my approach to social media aims to empower my followers in a unique way. My page is a vibrant mix of content, ranging from DIY tips to help people identify and navigate various emotions and situations, to engaging reels that provide a glimpse into my life with family and friends. You’ll find a blend of workouts, insights into my work, and other exciting facets. Through this diverse content, I strive to create a positive and uplifting space where my followers can feel inspired, informed, and connected. View this post on Instagram Read Also Former Mrs World Aditi Govitrikar Announces Her Own Pageant, Marvellous Mrs India (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.) Follow us on RECENT STORIES Guns And Gulaabs Web Review: Rajkummar Rao-Dulquer Salmaan-Starrer Is Letdown By Sloppy Storytelling Aditi Govitrikar On Juggling Multiple Careers: ‘My Focus Has Been On My Skills & Passion’ Ghoomer: Aishwarya Rai Bachchan Roots For Hubby Abhishek Bachchan's Latest Production Salman Khan’s Ex-Girlfriend Somy Ali On Kangana Ranaut: ‘She Is The Only Actress Who Never... Rajinikanth & Amitabh Bachchan To Reunite For A Film After 32 Years: Report",
      "url": "https://www.freepressjournal.in/entertainment/aditi-govitrikar-on-juggling-multiple-careers-my-focus-has-been-on-my-skills-passion",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/acc05e0a-d034-425b-afab-fcf257f1771d/17th_Feb_1_.png",
      "publish_date": "2023-08-19 03:00:00",
      "author": "Oshin Fernandes",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.448
    },
    {
      "id": 137114325,
      "title": "About Last Night: Tamannaah And Boyfriend Vijay Varma's Date Night",
      "text": "Tamannaah and Vijay Varma stepped out for a movie date last night in Mumbai. The stars were pictured at a theatre in Mumbai on Friday night. Tamannaah And Vijay Varma's dating rumours began last year after they attended Diljit Dosanjh's Mumbai concert together in December last year and shared pictures from it. The actress confirmed that she is dating her Lust Stories 2 co-star Vijay Varma during an interview earlier this year (more on that later). See pictures from last night here: The actress confirmed that she is dating her Lust Stories 2 co-star Vijay Varma during an interview with Film Companion and she said, \"I don't think you can get attracted to someone just because they are your co-star. I have had so many co-stars. I think if one has to fall for someone, feel something for someone it's definitely more personal, it's nothing to do with what they do for a living, I mean that's not the reason why this would happen.\" In terms of work, Tamannaah recently starred in Jailer, alongside Rajinikanth. She also starred in Amazon Prime Video's Jee Karda and the Netflix anthology film Lust Stories 2 this year. Tamannaah is best-known for her performances in films like Baahubali, Devi, Sye Raa Narasimha Reddy and her recent releases also include Plan A Plan B and Babli Bouncer. On the work front, Vijay Varma will next be seen in Sujoy Ghosh's The Devotion Of Suspect X alongside Kareena Kapoor and Jaideep Ahlawat. The actor starred in the smash hit series Dahaad this year. Vijay is best known for starring in films such as Darlings, Gully Boy, Pink, Ghost Stories, Super 30 and Baaghi 3. Vijay Varma has also starred in the web shows A Suitable Boy, She, Mirzapur and OK Computer.",
      "url": "https://www.ndtv.com/entertainment/about-last-night-tamannaah-and-boyfriend-vijay-varmas-date-night-4310728",
      "image": "https://c.ndtvimg.com/2023-08/ti2dvl7_-tamannaah_625x300_19_August_23.jpg",
      "publish_date": "2023-08-19 08:54:53",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.023
    },
    {
      "id": 137134839,
      "title": "Rajinikanth to watch Jailer with Uttar Pradesh CM Yogi Adityanath in Lucknow",
      "text": "Even though Superstar Rajinikanth's Jailer released ten days ago, there are no indications of its box-office momentum waning. Trade expert Manobala Vijaybalan has forecasted that the film is likely to cross the Rs 500-crore mark worldwide on Saturday. Meanwhile, Rajinikanth is currently gearing up to take part in a screening of Jailer in Lucknow, where he will be accompanied by Uttar Pradesh Chief Minister Yogi Adityanath. Uttar Pradesh Deputy Chief Minister Keshav Prasad Maurya will also attend the special screening of Jailer, helmed by Nelson Dilipkumar, in Lucknow. Upon his arrival in Lucknow on Friday, he conveyed to news agency ANI, \"I will watch the film with the CM. It's God's blessing that the movie is becoming a hit.\" Ahead of the screening in Lucknow, Rajinikanth met Uttar Pradesh governor Anandiben Patel at the Raj Bhavan on Saturday. The pictures of Rajinikanth's visit were posted on the official Twitter handle of the Governor of Uttar Pradesh. प्रदेश की राज्यपाल श्रीमती आनंदीबेन पटेल से आज राजभवन में प्रसिद्ध अभिनेता व निर्देशक श्री रजनीकान्त ने शिष्टाचार भेंट की। pic.twitter.com/Nr3rVHfPwZ — Governor of Uttar Pradesh (@GovernorofUp) August 19, 2023 #WATCH | Actor Rajinikanth arrives in Uttar Pradesh's Lucknow, says, \"I will watch the film (Jailor) with the CM\". pic.twitter.com/wsBdkosu18 — ANI (@ANI) August 18, 2023 Superstar Rajinikanth to visit Ayodhya tomorrow Rajini is also scheduled to visit Ayodhya on Sunday. Ahead of the release of Jailer, the legendary actor had gone on a spiritual trip to the Himalayas. On Thursday, Rajinikanth also paid a visit to Jharkhand governor CP Radhakrishnan in Ranchi, after returning from his Himalayas tour. Radhakrishnan, hailing from Tamil Nadu, was the former state president of the Bharatiya Janata Party in the state. #WATCH | Actor Rajinikanth in Lucknow on being asked about his visit to Ayodhya tomorrow; says, \"Jee kal program hai.\" pic.twitter.com/naUdniPd3N — ANI (@ANI) August 19, 2023 “On his arrival in Ranchi, delighted and very happy to meet my dear friend, one of India’s greatest Actors and great Human Being Superstar Shri. @rajinikanth Ji at Raj Bhavan yesterday on a courtesy meet. I heartily welcome him to the great land of Jharkhand,” Radhakrishnan wrote on Twitter while sharing images of him with the superstar. As per industry tracker Sacnilk, Jailer made Rs 9 crore on its ninth day of release on Friday, with Tamil occupancy leading at 34.53 per cent. The film’s total India nett collection now stands at Rs 244.85 crore.",
      "url": "https://indianexpress.com/article/entertainment/tamil/rajinikanth-jailer-uttar-pradesh-cm-yogi-adityanath-lucknow-8899542/",
      "image": "https://images.indianexpress.com/2023/08/rajini-yogi.jpg",
      "publish_date": "2023-08-19 11:05:53",
      "author": "Uttar Pradesh Chief",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.611
    },
    {
      "id": 137158431,
      "title": "Jailer director Nelson says his calculations went wrong in Vijay&#8217;s Beast: &#8216;Had I invested six to seven more months&#8230;&#8217;",
      "text": "If we were to personify the phrase 'rise from the ashes', director Nelson Dilipkumar would undoubtedly exemplify it. Despite facing extensive trolling and criticism for his previous action-comedy film Beast, which featured Thalapathy Vijay in the lead role, Nelson recently staged a remarkable resurgence and delivered a significant blockbuster to the Tamil film industry, Jailer. The Rajinikanth-starrer has already established itself as the highest-grossing Tamil film of 2023 and will soon cross the Rs 500-crore mark worldwide. Nelson recently opened up about what went wrong in Beast, despite its launch with the momentum from his prior successful directorial ventures, Kolamaavu Kokila and Doctor, as well as the inclusion of Vijay. \"Had I invested an additional six to seven months and meticulously crafted the movie, the responses to it might not have been so mixed. Initially, I believed I could finish the film within a set timeframe, but my calculations turned out to be inaccurate,\" Nelson expressed in a conversation with Film Companion. \"The Covid outbreak disrupted our shooting plans, preventing us from executing them as intended. There was room for some enhancement in the VFX, and certain scenes were still pending to be filmed. Various challenges arose, leading to several issues during the production process,\" he added. Nelson Dilipkumar on what Vijay told him after Beast failure During a recent interview with Galatta Plus, Nelson had mentioned how Vijay reacted after Beast’s release. “To be frank, when the film was released, he told ‘We made a film. You made what you told me you will. We put in our best effort. Some liked it, and some didn’t. We can’t do anything about it now. Let’s try doing something better next time.' I then asked him if he is upset with me,” Nelson recalled. \"He looked perplexed and asked ‘Why would I be pissed with you?’ I told him because the film is only getting a mixed response. He said ‘Yov (Arre)’ and left. He then came back and asked ‘So, our friendship is nothing more than a film, is it? You have hurt me by asking this'”. Stating that Vijay congratulated him following the success of Jailer, Nelson said: “He texted me saying he is happy about the success. That’s how we are. People keep saying a lot of things. It is better not to respond to all of that.” Apart from Vijay, Beast also starred Pooja Hegde, Selvaraghavan, Shaji Chen, VTV Ganesh, and Ankur Vikal in key roles. Bankrolled by Kalanithi Maran for Sun Pictures, Beast minted approximately Rs 216.58 crore worldwide, according to the industry tracker Sacnilk, surpassing its budget of about Rs 150 crore.",
      "url": "https://indianexpress.com/article/entertainment/tamil/jailer-director-nelson-calculations-went-wrong-vijay-beast-8899778/",
      "image": "https://images.indianexpress.com/2023/08/Nelson-beast.jpg",
      "publish_date": "2023-08-19 13:09:19",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.235
    },
    {
      "id": 137189915,
      "title": "WATCH: Superstar Rajinikanth Touches UP CM Yogi Adityanaths Feet Ahead of Special Jailer Screening",
      "text": "Superstar Rajnikanth is currently basking in the success of his recently released film Jailer. It has also been declared one of the highest-grossing Indian films of 2023. The actor, who recently landed in Lucknow on Friday, just a while back arrived at Uttar Pradesh CM Yogi Adityanath's residence to meet him. (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.)",
      "url": "https://www.freepressjournal.in/entertainment/watch-superstar-rajinikanth-touches-up-cm-yogi-adityanaths-feet-ahead-of-special-jailer-screening",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/c8600f6c-ffb3-4a7e-8f10-de941003a6dd/Screenshot_2023_08_19_193109.jpg",
      "publish_date": "2023-08-19 16:06:53",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.688
    },
    {
      "id": 137292455,
      "title": "India’s Best Dancer 3: Dream Girl 2 Actor Ayushmann Khurrana Reveals His Admiration For Sonali Bendre",
      "text": "India’s Best Dancer 3: Dream Girl 2 Actor Ayushmann Khurrana Reveals His Admiration For Sonali Bendre HomeEntertainmentIndia’s Best Dancer 3: Dream Girl 2 Actor Ayushmann Khurrana Reveals His Admiration For Sonali Bendre India’s Best Dancer 3: Dream Girl 2 Actor Ayushmann Khurrana Reveals His Admiration For Sonali Bendre Actor and his Dream Girl 2 co-star Ananya Panday graced the reality show to promote their film CJ DeskUpdated: Saturday, August 19, 2023, 08:20 PM IST Today, the dance reality show, India’s Best Dancer 3, is set to captivate audiences with its enthralling ‘Dream Girl Special’. Gracing the episode will be the charismatic duo – Ayushmann Khurrana and Ananya Panday, who will be promoting their upcoming film, Dream Girl 2. Making it a dreamy extravaganza, the contestants will strive to impress the judges and the special guests with their awe-inspiring dance moves. One of the highlights of the episode will be the scintillating performance by contestant Boogie LLB and choreographer Saumya Kamble. The duo will set the stage ablaze with their electrifying moves, choreographed to the iconic song Mukkala Mukabala, and will receive a huge round of applause from all. Ayushmann Khurrana on the sets of India’s Best Dancer 3 | Judge Geeta Kapur will complement the duo’s performance, saying, “Boogie, you are flawless when you perform solo. I couldn’t take my eyes off you. I often revisit Boogie’s performances, as there are truly astonishing aspects. Your style is executed so beautifully. And while you are an incredible performer, your choreographer, Soumya, contributes significantly to enhancing your dancing prowess.” She adds, “The way you both complement each other is commendable. Even if there are minor imperfections, Soumya’s ability to camouflage them is truly remarkable. Soumya, you are a fantastic choreographer. It is because of this synergy that Boogie is flourishing. I was enamoured by this act and admire your artistic finesse.” Adding to the excitement, Boogie showcased his poetic skill by dedicating a heartfelt shayari to Ananya. Impressed by this gesture, Ananya will thank Boogie. “I love his Shayari,” she states. Read Also India’s Best Dancer 3: Abhishek Bachchan Reveals He Played Cupid Between THIS Bollywood Couple The magic of the evening further intensifies as Ayushmann takes a heartfelt moment to express his admiration for the beautiful Sonali Bendre. “I’m a big fan of Sonali ma’am. We both were a part of India’s Got Talent, where she graced the judge’s panel, and I hosted the show. Ever since, I’ve been smitten by Sonali ma’am. My admiration for her has only grown over time. I had even sung a song for her back then,” he gushes. Recreating the moment once again, Ayushmann serenaded the audience with the soulful song Akeli Na Bazar Jaya Karo from the movie Major Saab (1998), dedicating it to Sonali Bendre. (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.) Follow us on RECENT STORIES India’s Best Dancer 3: Dream Girl 2 Actor Ayushmann Khurrana Reveals His Admiration For Sonali... Gadar 2 Actor Sunny Deol To Celebrate Raksha Bandhan With Step Sisters Esha, Ahana Deol At Their... 'Was Misunderstood': Ameesha Patel Clarifies Her 'OTT Filled With Gay-Lesbianism' Comment WATCH: Vivek Agnihotri Walks Out Of Interview, Threatens Journalist After Question Over BJP... Rajinikanth Trolled For Touching UP CM Yogi Adityanath’s Feet: 'Did He Leave His Self-Respect In...",
      "url": "https://www.freepressjournal.in/entertainment/indias-best-dancer-3-dream-girl-2-actor-ayushmann-khurrana-reveals-his-admiration-for-sonali-bendre",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/20daa8c8-daaf-433e-85f7-e7a0765fb2f2/AYUSHMANN_.jpg",
      "publish_date": "2023-08-20 00:30:00",
      "author": "CJ Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.859
    },
    {
      "id": 137326521,
      "title": "Watch: Rajinikanth Touches Yogi Adityanath&#039;s Feet At His Residence In Lucknow",
      "text": "Walk The Talk Walk The Tech Talk Walkabout Watan Ke Rakhwale We Mean Business We The People We've Got Mail Weekending Welcome To The Future What A Character! What's Your Choice? What's Your Solution Which Car Should I Buy? Will Travel For Food Wisdom Of Leaders Witness Women Of Worth",
      "url": "https://www.ndtv.com/video/news/news/rajinikanth-meets-yogi-watch-rajinikanth-touches-yogi-adityanath-s-feet-at-his-residence-in-lucknow-718605",
      "image": "https://c.ndtvimg.com/2023-08/nvrehkfo_rajinikanth-_640x480_19_August_23.jpg",
      "publish_date": "2023-08-20 04:11:54",
      "author": "UP Deputy Chief",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.899
    },
    {
      "id": 137344285,
      "title": "Gadar 2 box office collection day 9: Sunny Deol-starrer records biggest second Saturday of all time, inches towards Rs 400 crore",
      "text": "The movie Gadar 2, starring Sunny Deol and Ameesha Patel, is doing incredibly well at the box office, and it recently crossed the Rs 300 crore mark in India. After making Rs 20.5 crore on Friday, it jumped by 55 percent on its second Saturday, collecting Rs 32 crore, according to industry analyst Sacnilk. So far, the movie has collected a total of Rs 336.13 crore in India and Rs 395.1 crores worldwide. This is the biggest second Saturday of all time, ahead of Baahubali 2: The Conclusion (Rs 26.5 crore), The Kashmir Files (Rs 24.8 crore) and Pathaan (Rs 22 crore). The movie is expected to have a big second weekend, with Sacnilk predicting that it might earn Rs 40 crore on Sunday. Despite competition from Rajinikanth's Jailer and Akshay Kumar's OMG 2, Gadar 2 had a strong start, earning an impressive Rs 40 crores on its first day. Gadar 2 has even outperformed Salman Khan's Bajrangi Bhaijaan (Rs 320 crore), and by tomorrow, it's set to surpass Tiger Zinda Hai (Rs 339 crore), PK (Rs 340 crore) and Sanju (Rs 342 crore) to become the fifth-highest grossing Hindi movie ever at the domestic box office. View this post on Instagram A post shared by Zee Studios (@zeestudiosofficial) After Shah Rukh Khan's Pathaan, Gadar 2 is the biggest post-pandemic hit of the Hindi industry. Other films like Tu Jhoothi Main Makkkar, Satyaprem Ki Katha, and Kerala Story also fared well at the box office. Helmed by Anil Sharma, Sunny and Ameesha reprise their roles as Tara Singh and Sakina in the film. Gadar 2 also stars Utkarsh Sharma. The Indian Express critic Shubhra Gupta gave the film 1.5 stars and said that the film offers 'nothing new.' A part of the review read, \"This iteration just reminds of you the loudness and the saccharine and the over-the-top dialoguing that new Bollywood had started shaking off, which we hoped was safely behind us. Clearly, in vain.\"",
      "url": "https://indianexpress.com/article/entertainment/bollywood/gadar-2-box-office-collection-day-9-sunny-deol-second-saturday-400-crore-8900480/",
      "image": "https://images.indianexpress.com/2023/08/gadar-2-6.jpg",
      "publish_date": "2023-08-20 05:31:21",
      "author": "Anil Sharma",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.139
    },
    {
      "id": 137346501,
      "title": "Jailer box office collection Day 10: Rajinikanth-starrer crosses Rs 500 crore mark, sees a spike on second Saturday",
      "text": "Superstar Rajinikanth’s actioner Jailer continues to entertain audiences even in its second week. On its second Saturday, the film clocked a massive collection of Rs 18 crore (nett) at the box office. As per the industry tracker Sacnilk, the growth is around 80 percent from Friday's numbers, bringing its 10-day collection to Rs 245.9 crore in India. Jailer had 53.79 percent occupancy in the Tamil-speaking market and 46.73 percent in Telugu. Gadar 2 and OMG 2 continue to dominate the Hindi belt. While Abhishek Bachchan's Ghoomer was also released this Friday, it saw dismal numbers. Jailer has also managed to cross Rs 500 crore worldwide. As per industry analyst Manobala Vijayabalan, the Rajinikanth film crossed the big mark on its 10th day of release. It also became the third Tamil film to enter the club after 2.0 and Ponniyin Selvan: I. Jailer is the second-fastest film to cross the Rs 500 mark, after Rajinikanth-Akshay Kumar's 2.0 which earned the big number in just seven days. The Nelson Dilipkumar directorial also stars Tamannaah Bhatia in a pivotal role and tells the story of a man who is out to avenge his cop son’s death. The film also stars Mohanlal, Jackie Shroff and Shivarajkumar in significant roles. Besides them, the movie also features Priyanka Mohan, Ramya Krishnan, Yogi Babu, Vasanth Ravi and Vinayakan. Pointing out that Rajinikanth and Nelson Dilipkumar rediscover the alchemy of a good masala film, the Indian Express’ Kirubhakar Purushothaman wrote in his review of the film: “Jailer is Rajinikanth’s version of Kamal Haasan’s Vikram, but with a twist. Saying that doesn’t take away anything from this fun-filled entertainer.” Rajinikanth meets Yogi Adiyanath Meanwhile, Rajinikanth was part of a special screening of Jailer in Lucknow, where he was joined by Uttar Pradesh Chief Minister Yogi Adityanath. Uttar Pradesh Deputy Chief Minister Keshav Prasad Maurya also attended the special screening. Videos of Rajinikanth bowing to touch Yogi's feet have gone viral on social media, invoking mixed reaction from fans. Ahead of the screening in Lucknow, Rajinikanth met Uttar Pradesh governor Anandiben Patel at the Raj Bhavan on Saturday. The pictures of Rajinikanth’s visit were posted on the official Twitter handle of the Governor of Uttar Pradesh. Rajini is also scheduled to visit Ayodhya on Sunday. Ahead of the release of Jailer, the legendary actor had gone on a spiritual trip to the Himalayas. On Thursday, the superstar had also paid a visit to Jharkhand governor CP Radhakrishnan in Ranchi, after returning from his Himalayas tour. Radhakrishnan, hailing from Tamil Nadu, was the former state president of the Bharatiya Janata Party.",
      "url": "https://indianexpress.com/article/entertainment/tamil/jailer-box-office-collection-day-10-rajinikanth-starrer-crosses-rs-500-crore-8900484/",
      "image": "https://images.indianexpress.com/2023/08/Jailer-1.jpg",
      "publish_date": "2023-08-20 05:50:53",
      "author": "Uttar Pradesh Chief",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.298
    },
    {
      "id": 137357535,
      "title": "Ghoomer box office collection day 2: Abhishek Bachchan&#8217;s sports drama bowled out with just Rs 2 crore in two days",
      "text": "Abhishek Bachchan-led Ghoomer was released in theatres on Friday, amid the Gadar 2 madness at the box office. With Sunny Deol's period drama sequel is keeping audiences enthralled in theatres, the R Balki sports drama did not find many takers. After a dismal opening of Rs 85 lakh, the film only managed to collect Rs 1.2 crore (nett) on Saturday. The film's two-day collections stand at Rs 2 crore, as per industry tracker Sacnilk. The website also said that Ghoomer had an overall 29.97 percent occupancy in the Hindi-speaking market. Night shows saw the maximum audience, followed by evening, afternoon and morning shows. On the other hand, Sunny Deol's Gadar 2 has collected a total of Rs 336.13 crore in India and Rs 395.1 crores worldwide. Akshay Kumar-Pankaj Tripathi's OMG 2 also is doing fair business and has already crossed Rs 100 crore. Rajinikanth's actioner Jailer also saw a spike in its second week and has managed to mint more than Rs 500 crore in 10 days, worldwide. Ghoomer also stars Saiyami Kher, Shabana Azmi and Angad Bedi. It tells the tale of a young cricketer who loses her right arm in an accident. An alcoholic coach takes it on himself to train her to bowl with her left hand. The film celebrates her triumph over adversity. Indian Express' Shubhra Gupta gave Ghoomer a 2.5-star rating, and wrote in her review, \"In keeping its gaze so firmly on the reluctant student-strict teacher duo, the film reduces the other characters to the periphery.\" Saiyami Kher thanks fans for loving Ghoomer: \"If you had told me a few years ago, that I’d wake up reading the praise which I’ve received for Ghoomer, I would have never believed you. I didn’t have that faith in myself, leave alone anyone else instilling it in me. It’s hard to explain what this film means to me,\" she tweeted in gratitude.",
      "url": "https://indianexpress.com/article/entertainment/bollywood/ghoomer-box-office-collection-day-2-abhishek-bachchan-2-crore-8900512/",
      "image": "https://images.indianexpress.com/2023/08/ghoomer-1.jpg",
      "publish_date": "2023-08-20 06:44:53",
      "author": "Karnataka HC",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.285
    },
    {
      "id": 137384369,
      "title": "OMG! Gadar 2 Star Sunny Deols Mumbai Villa To Be Auctioned For Non-Payment Of Dues Amounting To ₹56 Crore",
      "text": "OMG! Gadar 2 Star Sunny Deol's Mumbai Villa To Be Auctioned For Non-Payment Of Dues Amounting To ₹56 Crore HomeEntertainmentOMG! Gadar 2 Star Sunny Deol's Mumbai Villa To Be Auctioned For Non-Payment Of Dues Amounting To ₹56 Crore OMG! Gadar 2 Star Sunny Deol's Mumbai Villa To Be Auctioned For Non-Payment Of Dues Amounting To ₹56 Crore The Mumbai studio will be e-auctioned on September 25 due to non-payment of nearly Rs 56 crore FPJ Web DeskUpdated: Sunday, August 20, 2023, 12:55 PM IST Sunny Deol | File photo by Viral Bhayani Bollywood actor-politician Sunny Deol's villa in Juhu, Mumbai, is all set to be auctioned in September 2023 for non-payment of dues amounting to nearly Rs 56 crore. The actor is currently enjoying the success of Gadar 2 which has collected Rs 336 crore within nine days of its theatrical release. According to a notice published by Bank Of Baroda in The Free Press Journal, the villa will be e-auctioned on September 25 due to non-payment of Rs 55,99,80,766. The notice also mentions that Sunny Deol, whose real name is Ajay Singh, is the borrower and guarantor and that he has failed to pay the above mentioned figure to the bank on time. Read Also Sunny Deol Quashes Reports Of Border Sequel Amid Gadar 2 Success: 'Have NOT Signed Any Film' The villa, located at Gandhigram Road in Juhu, houses Sunny Super Sound, which is a post-production studio. Several Bollywood celebrities are often spotted outside the studio. A lot of films are also screened here. According to a report in Bollywood Hungama, after paying the amount at auction, the buyer will only get the symbolic possession of the property. Also, Sunny Deol can operate his business from Sunny Villa until the District Magistrate approves to give the physical possession to the buyer. View this post on Instagram Meanwhile, the actor is currently enjoying the success of his latest film Gadar 2, which is a sequel to his 2001 film Gadar. Directed by Anil Sharma, the film entered the Rs 300 crore club within just eight days of its release. In the film, he reprises his role as Tara Singh, and Ameesha Patel is seen as Sakeena. Gadar 2 is based on the backdrop of the 1971 India-Pakistan war. The film also features Utkarsh Sharma, Luv Sinha, Simrat Kaur, Gaurav Chopra and Manish Wadhwa in significant roles. Read Also Gadar 2 Actor Sunny Deol To Celebrate Raksha Bandhan With Step Sisters Esha, Ahana Deol At Their... (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.) Follow us on RECENT STORIES OMG! Gadar 2 Star Sunny Deol's Mumbai Villa To Be Auctioned For Non-Payment Of Dues Amounting To... This Is Us Actor Ron Cephas Jones Passes Away At 66 5 Times Actors Touched Politicians' Feet: SRK-Mamata Banerjee To Amitabh Bachchan-Balasaheb... Sunny Deol Quashes Reports Of Border Sequel Amid Gadar 2 Success: 'Have NOT Signed Any Film' Superstar Rajinikanth Hugs 'Friend Of 9 Years' SP Chief Akhilesh Yadav, Latter Says 'Jab Dil Milte...",
      "url": "https://www.freepressjournal.in/entertainment/omg-gadar-2-star-sunny-deols-mumbai-villa-to-be-auctioned-for-non-payment-of-dues-amounting-to-56-crore",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/59d33fd8-bbfe-48cd-9552-6ece238db223/WhatsApp_Image_2021_11_23_at_7_12_21_PM.jpeg",
      "publish_date": "2023-08-20 09:21:42",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.097
    },
    {
      "id": 137422983,
      "title": "Video: Nick Jonas Loses His Cool After Fan Throws Wristband At Him During His LIVE Performance In Toronto",
      "text": "Video: Nick Jonas Loses His Cool After Fan Throws Wristband At Him During His LIVE Performance In Toronto HomeEntertainmentVideo: Nick Jonas Loses His Cool After Fan Throws Wristband At Him During His LIVE Performance In Toronto Video: Nick Jonas Loses His Cool After Fan Throws Wristband At Him During His LIVE Performance In Toronto A few days back, a female fan hurled a bra at Nick during his show at Yankee Stadium FPJ Web DeskUpdated: Sunday, August 20, 2023, 04:41 PM IST Singer Nick Jonas is the latest celebrity to have an object being thrown at him during his LIVE concert in Toronto. Several videos of the singer have surfaced on social media. One of the videos show Nick getting angry after someone from the crowd threw a wristband at him in the middle of his performance on stage. The band struck his chest and the act left the singer shocked. Nick immediately flinched and asked the fan not to do it again. Without further ado, he continued with his performance. Take a look at the video here: View this post on Instagram Just a few days back, a female fan hurled a bra at Nick during his show at Yankee Stadium in New York. At that time, he paused briefly and then continued singing. It may be mentioned that this is not the first time that an artist has been hit on stage. In the last few weeks, Harry styles, Drake, Bebe Rexha, Pink, Kid Cudi, Steve Lacy Kelsea Ballerini and Ava Max among others have been victimised. Ahead of his concert in Toronto, Nick had shared a series of photos with Kevin and Joe on Instagram and wrote, \"Thanks for a magical night in Connecticut. Excited to bring the show to Toronto tomorrow.\" View this post on Instagram Nick is currently on a tour across the United States with his brothers Kevin Jonas and Joe Jonas. Several videos of the Jonas Brothers' energetic performances have been going viral on social media platforms. Last week, Nick made headlines after he fell on stage while performing. Read Also Priyanka Chopra Distributes Snacks To Staff During Nick Jonas' Boston Concert; Video Goes Viral (To receive our E-paper on WhatsApp daily, please click here. To receive it on Telegram, please click here. We permit sharing of the paper's PDF on WhatsApp and other social media platforms.) Follow us on RECENT STORIES Video: Nick Jonas Loses His Cool After Fan Throws Wristband At Him During His LIVE Performance In... WATCH: Rajinikanth Offers Prayers At Ayodhya's Hanuman Garhi Temple, To Visit Ram Mandir Later After Gadar 2 Success, Sunny Deol's Maa Tujhhe Salaam To Get A Sequel? BTS V To Jungkook: Chart-Topping K-pop Soloists With Massive Spotify Followers Bigg Boss OTT 2 Fame Jiya Shankar Asks Fans To STOP Shipping Her With Abhishek Malhan: 'We Are...",
      "url": "https://www.freepressjournal.in/entertainment/video-nick-jonas-loses-his-cool-after-fan-throws-wristband-at-him-during-his-live-performance-in-toronto",
      "image": "https://gumlet.assettype.com/freepressjournal/2023-08/2d50e660-0a54-4111-bc4e-1a56f5c98107/Untitled_design___2023_08_20T163627_443.jpg",
      "publish_date": "2023-08-20 13:11:04",
      "author": "FPJ Web Desk",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.047
    },
    {
      "id": 137584999,
      "title": "Jailer box officer collection Day 11: Rajinikanth&#8217;s latest is expected to become highest-grossing Tamil film",
      "text": "While Rajinikanth's act of touching the feet of Uttar Pradesh Chief Minister Yogi Adityanath seems to have disappointed many down South, the Superstar's Jailer continues to live up to audiences' expectations. On Day 11, the masala film, directed by Nelson Dilipkumar, is still having good momentum at the box office. According to Sacnilk, the movie earned Rs 18.5 crore on its second Sunday at the Indian box office. The number is a significant rise from its nationwide collection on Day 10: Rs 16.25 crore. Earlier, film trade analyst Manobala Vijayabalan tweeted that the movie has crossed the Rs 500 crore mark at the box office worldwide. However, a Sacnilk report claims that the film has minted only Rs 477.6 crore so far. The report also stated that the movie has so far collected Rs 280 crore from across the nation with an average occupancy of more than 50 per cent in most of the cities and towns in Tamil Nadu. Earlier, speaking to The Indian Express, film trade analyst Ramesh Bala predicted that Jailer will earn Rs 700 crore (lifetime collection). If the movie continues its current pace at the box office, it also has a chance to touch Rs 800 crore and become the highest-grossing Tamil film. Currently, Rajinikanth's 2.0 holds the top spot, which might get conquered yet again by the Superstar. Also starring Jackie Shroff, Mohanlal, Shivrajkumar, and Kishore in cameos, Jailer follows the story of a retired police officer, who uses his connections with former prisoners to save his son from a gangster. Rajinikanth will next team up with director TJ Gnanvel, who shot to fame with the film Jai Bhim, starring Suriya. The movie is currently referred to as Thalaivar 170, denoting the number of films in Rajini's career. It is now rumoured that the film will be titled Vettaiyan. Another rumour about the actor is that he is set to join Lokesh Kanagaraj's cinematic universe.",
      "url": "https://indianexpress.com/article/entertainment/tamil/jailer-box-officer-collection-day-11-rajinikanths-latest-is-expected-to-become-highest-grossing-tamil-film-8901559/",
      "image": "https://images.indianexpress.com/2023/08/Rajinikanth-in-Jailer-A-screenshot-from-Rathamaarey-song.jpg",
      "publish_date": "2023-08-21 04:47:02",
      "author": "Nelson Dilipkumar",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.403
    },
    {
      "id": 137590211,
      "title": "Gadar 2 box office collection day 10: Sunny Deol-starrer set to cross Rs 400 crore mark",
      "text": "The fervour surrounding Gadar 2 shows no signs of abating. Following its record-breaking second Saturday collection of Rs 31.07 crore, the film added Rs 41 crore to its Indian box office haul on Sunday, August 20, according to industry tracker Sacnilk. The Sunny Deol and Ameesha Patel-starrer, which is rewriting box office records at a remarkable pace, has now amassed a staggering total of Rs 377.20 crore and is set to cross the Rs 400 crore mark soon. In the face of competition from Rajinikanth's Jailer and Akshay Kumar's OMG 2 since its release, Gadar 2 remains a potent draw for moviegoers, as evidenced by its impressive Rs 40 crore opening day collection. The film's strong box office performance has sustained over the weeks, with Sunday recording a commendable 72.60 percent overall occupancy rate. However, the movie is bracing itself for another challenge as Ayushmann Khurrana and Ananya Panday's Dream Girl 2 is slated for release on Friday, August 25. Gadar 2 has not only outstripped Salman Khan's Bajrangi Bhaijaan (Rs 320 crore) but has also surpassed the earnings of Tiger Zinda Hai (Rs 339 crore), PK (Rs 340 crore), and Sanju (Rs 342 crore) to claim the position of the fifth-highest grossing Hindi movie ever at the domestic box office. Emerging as the Hindi film industry's biggest post-pandemic hit after Shah Rukh Khan's Pathaan, Gadar 2 has secured its place as a blockbuster. Despite lukewarm reviews, Gadar 2 continues to set the cash registers ringing. The Indian Express critic Shubhra Gupta gave the film 1.5 stars and wrote, \"Even when it came out, 22 years back, ‘Gadar’ was much too loud and melodramatic, very much the kind of doused-in-patriotism film that director Anil Sharma was known to make: that style was already going out of style. This iteration just reminds of you the loudness and the saccharine and the over-the-top dialoguing that new Bollywood had started shaking off, which we hoped was safely behind us. Clearly, in vain.\"",
      "url": "https://indianexpress.com/article/entertainment/bollywood/gadar-2-box-office-collection-day-10-sunny-deol-starrer-set-to-cross-rs-400-crore-mark-8901713/",
      "image": "https://images.indianexpress.com/2023/08/Sunny-6.jpg",
      "publish_date": "2023-08-21 05:28:53",
      "language": "en",
      "source_country": "in",
      "sentiment": -0.187
    },
    {
      "id": 137609885,
      "title": "Case against 90 people for blocking Uttar Pradesh minister&#039;s convoy with stray cattle",
      "text": "An FIR was registered on Sunday against 90 unidentified people for blocking the convoy of Uttar Pradesh minister Dharampal Singh in Bareilly district while he was on his way to attend a programme, police said.Angry locals on August 17 blocked the animal husbandry minister's convoy by bringing stray cattle on the road in Sirauli area of his assembly constituency Aonla.Additional SP (rural) Rajkumar Agarwal said that on a complaint of veterinary officer Sanjay Kumar Sharma, an FIR under IPC Section 341 (wrongfully restraining any person) has been registered against 90 unidentified people in the matter.The minister, along with Additional Chief Secretary Rajneesh Dubey, was going for the 'bhoomi pujan' of an animal polyclinic, which is to be set up at a cost of Rs 9.14 crore at Gurgaon in Aonla tehsil where animals will get round-the-clock care. Locals from Pipariya Uprala village then blocked the road, apparently to draw his attention to the problem of stray cattle.The minister's convoy was stuck in the melee for about 40 minutes.Singh assured the villagers that a cow shelter would soon be set up after identifying the land of the gram sabha in the area.The problem of stray cattle was prominently raised by the Opposition parties during the state Assembly polls last year.Edited By: Prateek ChakrabortyPublished On: Aug 21, 2023ALSO READ | 'Cat crossing path' superstition lands 3 thieves in jail in UP's JhansiALSO READ | Watch: Superstar Rajinikanth touches Yogi Adityanath's feet post Jailer screeningMust Watch",
      "url": "https://www.indiatoday.in/india/story/up-minister-convoy-blocked-stray-cattle-case-against-90-people-bareilly-2424148-2023-08-21",
      "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/media_bank/202308/stray-cattle-on-street-215100-16x9.jpeg?VersionId=Ce6kABXLWaLS.ZLyuJuEL2j56NVVzOGq?size=1200:675",
      "publish_date": "2023-08-21 07:12:53",
      "author": "Press Trust",
      "language": "en",
      "source_country": "in",
      "sentiment": 0.147
    }
  ]
}